// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Люди должны ... природу.",
  answer: "Б) беречь", 
  options: [
    "А) берегут", 
    "Б) беречь",
    "В) берегли",
    ""
  ]
},
  { 
  numb: 2,
  question: "Я хочу ... гостей в субботу.",
  answer: "В) пригласить", 
  options: [ 
    "А) приглашать", 
    "Б) пригласил",
    "В) пригласить",
    ""
  ]
},
  {
  numb: 3, 
  question: "Экскурсовод ... туристам город 3 часа.", 
  answer: "А) показывал", 
  options: [
    "А) показывал", 
    "Б) показал",
    "В) покажет",
    ""
  ]
},
  {
  numb: 4,
  question: "Лоре нужно ... с подругой сегодня в 10 часов.", 
  answer: "А) встретиться",  
  options: [
    "А) встретиться", 
    "Б) встречаться",
    "В) встретятся",
    ""
  ]
},
  {
  numb: 5,
  question: "Раньше в этом магазине ... фрукты.",  
  answer: "В) продавали", 
  options: [ 
    "А) продают", 
    "Б) продали",
    "В) продавали",
    ""
  ]
},
{
  numb: 6,
  question: "Виктор решил ... экономистом.", 
  answer:  "Б) стать",  
  options: [
    "А) стал", 
    "Б) стать",
    "В) станет",
    ""
  ]
},
{
  numb: 7,
  question: "Журналист ... Дженни за интервью и попрощался.",  
  answer: "А) поблагодарил", 
  options: [
    "А) поблагодарил", 
    "Б) благодарил",
    "В) благодарит",
    "" 
  ]
},
{
  numb: 8,
  question: "Учитель ... с учениками 2 часа.", 
  answer: "Б) беседовал",
  options: [
    "А) беседовать", 
    "Б) беседовал",
    "В) побеседовал",
    "" 
  ]
},
{
  numb: 9,
  question: "В детстве мой брат часто ...", 
  answer: "В) болел",  
  options: [
    "А) болеет ", 
    "Б) заболел",
    "В) болел",
    "" 
  ]
},
{
  numb: 10,
  question: "Он обрадовался, когда ... Дженни.", 
  answer: "В) увидел",
  options: [
    "А) вижу", 
    "Б) видел",
    "В) увидел",
    "" 
  ]
},
{
  numb: 11,
  question: "Артист ... полтора часа.", 
  answer: "А) выступал", 
  options: [ 
    "А) выступал", 
    "Б) выступил",
    "В) выступит",
    "" 
  ]
},
{
  numb: 12,
  question: "Мы должны ... этот экзамен хорошо. ",  
  answer: "В) сдать",  
  options: [
    "А) сдавать", 
    "Б) сдадим",
    "В) сдать",
    "" 
  ]
},
{
  numb: 13,
  question: "Карин любит ... животных.", 
  answer: "Б) фотографировать",  
  options: [
    "А) фотографирует",  
    "Б) фотографировать",
    "В) сфотографировал",
    "" 
  ]
},
{
  numb: 14,
  question: "Преподаватель не успел ... диктант.", 
  answer: "В) проверить",
  options: [
    "А) проверять",  
    "Б) проверяет",
    "В) проверить",
    "" 
  ] 
}, 
{
  numb: 15,
  question: "Жан начал ... русский язык 2 месяца назад. ", 
  answer: "А) изучать", 
  options: [
    "А) изучать",  
    "Б) изучает",
    "В) изучал",
    "" 
  ]
},
{
  numb: 16,
  question: "По субботам они ... в футбол.", 
  answer: "Б) играли",
  options: [
    "А) поиграли",  
    "Б) играли",
    "В) поиграть",
    ""
  ]
},
{
  numb: 17,
  question: "Мария вошла в квартиру и ... пальто. ", 
  answer: "А) сняла", 
  options: [
    "А) сняла",  
    "Б) снимала",
    "В) снимет",
    ""
  ]
},
{
  numb: 18,
  question: "Вчера в клубе Иван ... с Ольгой.", 
  answer: "Б) познакомился",
  options: [ 
    "А) знакомился",  
    "Б) познакомился",
    "В) познакомиться",
    ""
  ]
},
{
  numb: 19,
  question: "Дети не любят ... лекарства.",  
  answer: "А) принимать",  
  options: [
    "А) принимать",  
    "Б) принять",
    "В) принимают",
    ""
  ]
},
{
  numb: 20, 
  question: "Завтра я обязательно ... письмо родителям и пошлю его.",  
  answer: "В) напишу",  
  options: [
    "А) пишу",  
    "Б) буду писать",
    "В) напишу",
    ""
  ]
},
{
  numb: 21,
  question: "Учёный ... новую теорию.",  
  answer: "Б) создал", 
  options: [
    "А) создавал",
    "",
    "Б) создал",
    "" 
  ]
}, 
{
  numb: 22,
  question: "Композитор ... оперу 18 лет.",  
  answer: "А) создавал",  
  options: [
    "А) создавал",
    "",
    "Б) создал",
    "" 
  ]
},
{
  numb: 23,
  question: "Кто ... эту модель?",  
  answer: "Б) создал", 
  options: [
    "А) создавал",
    "",
    "Б) создал",
    "" 
  ]
},
{
  numb: 24,
  question: "Летом Борис всегда … рано. ", 
  answer: "А) вставал", 
  options: [
    "А) вставал",
    "",
    "Б) встал",
    "" 
  ]
},
  { 
  numb: 25,
  question: "В воскресенье Антон ... в 8 часов. ", 
  answer: "Б) встал", 
  options: [ 
    "А) вставал",
    "",
    "Б) встал",
    "" 
  ]
},
  {
  numb: 26, 
  question: "Он ... и начал одеваться.", 
  answer: "Б) встал", 
  options: [
    "А) вставал",
    "",
    "Б) встал",
    "" 
  ]
},
  {
  numb: 27, 
  question: "Мы ... эти слова полчаса.",  
  answer: "А) учили", 
  options: [
    "А) учили",
    "",
    "Б) выучили",
    ""  
  ]
},
  { 
  numb: 28,
  question: "Студенты ... стихи и пошли в кино.",  
  answer: "Б) выучили",
  options: [ 
    "А) учили",
    "",
    "Б) выучили",
    ""  
  ]
},
{
  numb: 29,
  question: "Дети ... текст, а бабушка читала.",  
  answer: "А) учили", 
  options: [
    "А) учили",
    "",
    "Б) выучили",
    ""  
  ]
},
{
  numb: 30,
  question: "Андрей ... специальность долго.",  
  answer: "А) выбирал",
  options: [
    "А) выбирал",
    "",
    "Б) выбрал",
    "" 
  ]
},
{
  numb: 31,
  question: "Питер ... книгу и заплатил за неё.", 
  answer: "Б) выбрал", 
  options: [
    "А) выбирал",
    "",
    "Б) выбрал",
    "" 
  ]
},
{
  numb: 32,
  question: "Когда я ... цветы, Хуан ждал меня.",  
  answer: "А) выбирал",  
  options: [
    "А) выбирал",
    "",
    "Б) выбрал",
    "" 
  ]
},
{
  numb: 33,
  question: "Родители часто ... мне книги.", 
  answer: "А) дарили", 
  options: [
    "А) дарили",  
    "",
    "Б) подарили",
    "" 
  ]
},
{
  numb: 34,
  question: "Мы ... артисту красивый букет.",  
  answer: "Б) подарили",
  options: [ 
    "А) дарили",  
    "",
    "Б) подарили",
    "" 
  ]
},
{
  numb: 35,
  question: "В день рождения друзья ... Лейле картину.",  
  answer: "Б) подарили", 
  options: [
    "А) дарили",  
    "",
    "Б) подарили",
    "" 
  ]
},
{
  numb: 36,
  question: "Моя сестра всегда ... книги в этой библиотеке.", 
  answer: "А) брала ", 
  options: [
    "А) брала ",  
    "",
    "Б) взяла",
    "" 
  ]
},
{
  numb: 37,
  question: "Кристина ... словарь и начала переводить текст.", 
  answer: "Б) взяла",
  options: [
    "А) брала ",  
    "",
    "Б) взяла",
    "" 
  ]
}, 
{
  numb: 38,
  question: "Анна ... зонт и вышла на улицу.",  
  answer: "Б) взяла", 
  options: [ 
    "А) брала ",  
    "",
    "Б) взяла",
    "" 
  ]
},
{
  numb: 39,
  question: "Прохожий быстро ... мне, где находится метро. ", 
  answer: "Б) объяснил",  
  options: [
    "А) объяснял",   
    "",
    "Б) объяснил",
    "" 
  ]
},
{
  numb: 40,
  question: "Раньше я часто ... брату задачи.", 
  answer: "А) объяснял", 
  options: [
    "А) объяснял",   
    "",
    "Б) объяснил",
    "" 
  ]
},
{
  numb: 41,
  question: "Преподаватель ... слова, и мы начали читать текст.",  
  answer: "Б) объяснил", 
  options: [
    "А) объяснял",   
    "",
    "Б) объяснил",
    "" 
  ]
}, 
{
  numb: 42,
  question: "Спортсмены ... на вопросы журналистов 2 часа.",  
  answer: "А) отвечали",  
  options: [
    "А) отвечали",   
    "",
    "Б) ответили",
    "" 
  ]
},
{
  numb: 43,
  question: "В турфирме не ... на все наши вопросы.",  
  answer: "Б) ответили",
  options: [
    "А) отвечали",   
    "",
    "Б) ответили",
    "" 
  ]
},
{
  numb: 44,
  question: "Друзья всегда ... на мои письма.", 
  answer: "А) отвечали", 
  options: [
    "А) отвечали",   
    "",
    "Б) ответили",
    "" 
  ]
},
  { 
  numb: 45,
  question: "Вчера Жан ... в театр.", 
  answer: "Б) ходил", 
  options: [ 
    "А) шёл",   
    "",
    "Б) ходил",
    "" 
  ]
},
  {
  numb: 46, 
  question: "Раньше он редко ... в спортзал. ", 
  answer: "Б) ходил", 
  options: [
    "А) шёл",   
    "",
    "Б) ходил",
    "" 
  ]
},
  {
  numb: 47, 
  question: "Когда я ... на работу, я встретил Павла.",  
  answer: "А) шёл",  
  options: [
    "А) шёл",   
    "",
    "Б) ходил",
    "" 
  ]
},
  { 
  numb: 48,
  question: "В субботу мы ... в клуб.",  
  answer: "Б) ходили",
  options: [ 
    "А) шли",   
    "",
    "Б) ходили",
    "" 
  ]
},
{
  numb: 49,
  question: "Дети ... в лес 2 часа.",  
  answer: "А) шли", 
  options: [
    "А) шли",   
    "",
    "Б) ходили",
    "" 
  ]
},
{
  numb: 50,
  question: "Когда мы ... в кино, начался дождь.",  
  answer: "А) шли",
  options: [
    "А) шли",   
    "",
    "Б) ходили",
    "" 
  ]
},
{
  numb: 51,
  question: "Мария, ты уже ... в Эрмитаж?",  
  answer: "Б) ходила", 
  options: [
    "А) шла",   
    "",
    "Б) ходила",
    "" 
  ]
}, 
{
  numb: 52,
  question: "Когда она ... на урок, она разговаривала с Мартой.",  
  answer: "А) шла",  
  options: [
    "А) шла",   
    "",
    "Б) ходила",
    "" 
  ]
},
{
  numb: 53,
  question: "Эта студентка ... вчера к врачу.",  
  answer: "Б) ходила",
  options: [
    "А) шла",   
    "",
    "Б) ходила",
    "" 
  ]
},
{
  numb: 54,
  question: "Ты всегда... на дискотеку по субботам?", 
  answer: "Б) ходишь", 
  options: [
    "А) идёшь ",   
    "",
    "Б) ходишь",
    "" 
  ]
},
  { 
  numb: 55,
  question: "Ты сейчас ... к Лене?", 
  answer: "А) идёшь ", 
  options: [ 
    "А) идёшь ",   
    "",
    "Б) ходишь",
    "" 
  ]
},
  {
  numb: 56, 
  question: "- Привет, Юра! Куда ты ...?", 
  answer: "А) идёшь ", 
  options: [
    "А) идёшь ",   
    "",
    "Б) ходишь",
    "" 
  ]
},
  {
  numb: 57, 
  question: "Мальчик не умеет... на велосипеде.",  
  answer: "Б) ездить",  
  options: [
    "А) ехать",
    "",
    "Б) ездить",
    ""
  ]
},
  { 
  numb: 58,
  question: "Пора ... домой, уже поздно. ",  
  answer: "А) ехать",
  options: [ 
    "А) ехать",
    "",
    "Б) ездить",
    ""
  ]
},
{
  numb: 59,
  question: "Моя дочь любит ... на машине.",  
  answer: "Б) ездить", 
  options: [
    "А) ехать",
    "",
    "Б) ездить",
    ""
  ]
},
{
  numb: 60,
  question: "Летом мои друзья ... на море.",  
  answer: "Б) ездили",
  options: [
    "А) ехали",
    "",
    "Б) ездили",
    ""
  ]
},
{
  numb: 61,
  question: "Когда мы ... на стадион, мы говорили о футболе.", 
  answer: "А) ехали", 
  options: [
    "А) ехали",
    "",
    "Б) ездили",
    ""
  ]
},
{
  numb: 62,
  question: "В январе родители ... в Австрию кататься на лыжах.",  
  answer: "Б) ездили",  
  options: [
    "А) ехали",
    "",
    "Б) ездили",
    ""
  ]
},
{
  numb: 63,
  question: "Ира часто ... в Петергоф.", 
  answer: "Б) ездит", 
  options: [
    "А) едет",
    "",
    "Б) ездит",
    ""
  ]
},
{
  numb: 64,
  question: "Сейчас машина ... быстро. ",  
  answer: "А) едет",
  options: [ 
    "А) едет",
    "",
    "Б) ездит",
    ""
  ]
},
{
  numb: 65,
  question: "Куда ... Оля каждый год?",  
  answer: "Б) ездит", 
  options: [
    "А) едет",
    "",
    "Б) ездит",
    ""
  ]
},
{
  numb: 66,
  question: "Мама идёт домой, она.... продукты.", 
  answer: "А) несёт", 
  options: [
    "А) несёт",
    "",
    "Б) носит",
    ""
  ]
},
{
  numb: 67,
  question: "Моника всегда... с собой словарь. ", 
  answer: "Б) носит",
  options: [
    "А) несёт",
    "",
    "Б) носит",
    ""
  ]
}, 
{
  numb: 68,
  question: "Антон ... книги, потому что идёт в библиотеку.",  
  answer: "А) несёт", 
  options: [
    "А) несёт",
    "",
    "Б) носит",
    ""
  ]
},
{
  numb: 69,
  question: "Друг ... из Москвы красивые сувениры.", 
  answer: "Б) привёз", 
  options: [
    "А) принёс", 
    "",
    "Б) привёз",
    ""
  ]
},
{
  numb: 70,
  question: "Отец пришёл из аптеки и ... лекарство.", 
  answer: "А) принёс", 
  options: [
    "А) принёс", 
    "",
    "Б) привёз",
    ""
  ]
},
{
  numb: 71,
  question: "Максим ... телевизор на машине.", 
  answer: "Б) привёз", 
  options: [
    "А) принёс", 
    "",
    "Б) привёз",
    ""
  ]
},
{
  numb: 72,
  question: "Сколько времени самолёт ... до Лондона?",  
  answer: "А) летит",  
  options: [
    "А) летит", 
    "",
    "Б) летает ",
    ""
  ]
},
{
  numb: 73,
  question: "Твой друг часто … В Москву? ", 
  answer: "Б) летает ", 
  options: [
    "А) летит", 
    "",
    "Б) летает ",
    ""
  ]
},
{
  numb: 74,
  question: "Сегодня Анна ... на родину.",  
  answer: "А) летит",
  options: [ 
    "А) летит", 
    "",
    "Б) летает ",
    ""
  ]
},
{
  numb: 75,
  question: "Сергей ... к нам в гости.",  
  answer: "Г) пришёл", 
  options: [
    "А) ушёл", 
    "Б) вошёл",
    "В) подошёл",
    "Г) пришёл"
  ]
},
{
  numb: 76,
  question: "Он ... к двери и открыл её.", 
  answer: "В) подошёл", 
  options: [
    "А) ушёл", 
    "Б) вошёл",
    "В) подошёл",
    "Г) пришёл"
  ]
},
{
  numb: 77,
  question: "Отца нет дома, он ... на работу.",  
  answer: "А) ушёл",  
  options: [
    "А) ушёл", 
    "Б) вошёл",
    "В) подошёл",
    "Г) пришёл"
  ]
},
{
  numb: 78,
  question: "Вера ... улицу и остановилась.", 
  answer: "Г) перешла", 
  options: [
    "А) ушла",
    "Б) подошла",
    "В) отошла ",
    "Г) перешла"
  ]
},
{
  numb: 79,
  question: "Мама выключила телевизор и ... от него.",  
  answer: "В) отошла ",
  options: [ 
    "А) ушла",
    "Б) подошла",
    "В) отошла ",
    "Г) перешла"
  ]
},
{
  numb: 80,
  question: "Лена ... к окну и закрыла его.",  
  answer: "Б) подошла", 
  options: [
    "А) ушла",
    "Б) подошла",
    "В) отошла ",
    "Г) перешла"
  ]
},
{
  numb: 81,
  question: "Машина ... к большому озеру.", 
  answer: "Г) подъехала", 
  options: [
    "А) переехала",
    "Б) заехала",
    "В) въехала",
    "Г) подъехала"
  ]
},
{
  numb: 82,
  question: "По дороге на работу я ... к подруге.", 
  answer: "Б) заехала",
  options: [
    "А) переехала",
    "Б) заехала",
    "В) въехала",
    "Г) подъехала"
  ]
}, 
{
  numb: 83,
  question: "Раньше она жила на окраине, а потом ... в центр.",  
  answer: "А) переехала", 
  options: [
    "А) переехала",
    "Б) заехала",
    "В) въехала",
    "Г) подъехала"
  ]
},
{
  numb: 84,
  question: "Мы ... на машине вокруг озера. ", 
  answer: "Б) объехали", 
  options: [
    "А) обошли", 
    "Б) объехали",
    "В) уехали",
    ""
  ]
},
{
  numb: 85,
  question: "Мои родители ... все залы музея.", 
  answer: "А) обошли", 
  options: [
    "А) обошли", 
    "Б) объехали",
    "В) уехали",
    ""
  ]
},
];