// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Я знаю человека, ... на семи языках.",
  answer: "Б) говорящего", 
  options: [
    "А) говорящий",
    "Б) говорящего",
    "В) говорящим",
    ""
  ]
},
  { 
  numb: 2,
  question: "Мы читаем статью об учёном, ... Нобелевскую премию.",
  answer: "А) получившем", 
  options: [ 
    "А) получившем", 
    "Б) получившим",
    "В) получивший",
    ""
  ]
},
  {
  numb: 3, 
  question: "Я познакомилась с математиком, ... МГУ.", 
  answer: "В) окончившим", 
  options: [
    "А) окончивший",
    "Б) окончившему",
    "В) окончившим",
    ""
  ]
},
  {
  numb: 4,
  question: "Мне нравится молодой человек, ... в нашей фирме.", 
  answer: "Б) работающий",  
  options: [
    "А) работающим", 
    "Б) работающий",
    "В) работающего",
    ""
  ]
},
  {
  numb: 5,
  question: "Я прочитал рассказ, ... в журнале «Звезда».",  
  answer: "А) напечатанный", 
  options: [ 
    "А) напечатанный", 
    "Б) напечатанным",
    "В) напечатанном",
    ""
  ]
},
{
  numb: 6,
  question: "Татьяна потеряла зонтик, ... вчера.", 
  answer:  "Б) купленный",  
  options: [
    "А) купленного", 
    "Б) купленный",
    "В) купленным",
    ""
  ]
},
{
  numb: 7,
  question: "Андрей сдал экзамены по всем предметам, ... в университете.",  
  answer: "А) изучаемым", 
  options: [
    "А) изучаемым", 
    "Б) изучаемые",
    "В) изучаемых",
    ""
  ]
},
{
  numb: 8,
  question: "Марина танцевала с гостем, ... к нам на вечер.", 
  answer: "Б) приглашённым",
  options: [
    "А) приглашённый", 
    "Б) приглашённым",
    "В) приглашённого",
    ""
  ]
},
{
  numb: 9,
  question: "Я ходила на выставку, ... в Эрмитаже.", 
  answer: "В) открытую",  
  options: [
    "А) открытая", 
    "Б) открытой",
    "В) открытую",
    "" 
  ]
},
{
  numb: 10,
  question: "Студенты обсуждают опыты, ... на занятии.", 
  answer: "А) проводимые",
  options: [
    "А) проводимые", 
    "Б) проводимых",
    "В) проводимыми",
    "" 
  ]
},
{
  numb: 11,
  question: "Мы говорили о книге, ... бразильским писателем.", 
  answer: "Б) написанной", 
  options: [ 
    "А) написанную", 
    "Б) написанной",
    "В) написанная",
    "" 
  ]
},
{
  numb: 12,
  question: "Надо найти человека, … испанский язык.",  
  answer: "А) знающего",  
  options: [
    "А) знающего", 
    "Б) знающий",
    "В) знающему",
    "" 
  ]
},
{
  numb: 13,
  question: "Марта читает письмо, ... отцом.", 
  answer: "А) присланное",  
  options: [
    "А) присланное", 
    "",
    "Б) приславшее",
    "" 
  ]
},
{
  numb: 14,
  question: "Джон рассказывает о книге, ... им вчера.", 
  answer: "А) прочитанной",
  options: [
    "А) прочитанной", 
    "",
    "Б) прочитавшей",
    "" 
  ] 
}, 
{
  numb: 15,
  question: "Спутники, ... в космос, служат несколько лет.", 
  answer: "Б) посланные", 
  options: [
    "А) посылающие",  
    "",
    "Б) посланные",
    ""  
  ]
},
{
  numb: 16,
  question: "Артистка поблагодарила зрителя, ... ей цветы.", 
  answer: "Б) подарившего",
  options: [
    "А) подаренного",  
    "",
    "Б) подарившего",
    ""  
  ]
},
{
  numb: 17,
  question: "Том вернулся и взял сумку, ... в аудитории.", 
  answer: "А) забытую", 
  options: [
    "А) забытую",  
    "",
    "Б) забывшую",
    "" 
  ]
},
{
  numb: 18,
  question: "Нам понравился вечер, ... студентами университета.", 
  answer: "Б) организованный",
  options: [ 
    "А) организовавший",  
    "",
    "Б) организованный",
    "" 
  ]
},
{
  numb: 19,
  question: "Мы учимся в институте, ... в XIX веке. ",  
  answer: "Б) основанном",  
  options: [
    "А) основавшем", 
    "",
    "Б) основанном",
    ""
  ]
},
{
  numb: 20, 
  question: "Я ответила на письмо,... мной вчера. ",  
  answer: "Б) полученное",  
  options: [
    "А) получившее", 
    "",
    "Б) полученное",
    ""
  ]
},
{
  numb: 21,
  question: "Антон смотрит все фильмы, ... в этом кинотеатре.",  
  answer: "Б) демонстрируемые", 
  options: [
    "А) демонстрирующие", 
    "",
    "Б) демонстрируемые",
    ""  
  ]
}, 
{
  numb: 22,
  question: "Мне трудно будет забыть слова, ... вами.",  
  answer: "Б) сказанные",  
  options: [
    "А) сказавшие", 
    "",
    "Б) сказанные",
    ""
  ]
},
{
  numb: 23,
  question: "Эта книга написана для студентов, ... русский язык.",  
  answer: "Б) изучающих", 
  options: [
    "А) изучаемых", 
    "",
    "Б) изучающих",
    ""
  ]
},
{
  numb: 24,
  question: "Преподаватель поздравил студентов, … на олимпиаде.", 
  answer: "Б) победивших", 
  options: [
    "А) побеждённых", 
    "",
    "Б) победивших",
    ""
  ]
},
  { 
  numb: 25,
  question: "Эта статья ... в последнем номере журнала.", 
  answer: "А) напечатана", 
  options: [ 
    "А) напечатана", 
    "",
    "Б) напечатанная",
    ""
  ]
},
  {
  numb: 26, 
  question: "Выставка, ... сирийскими студентами, понравилась всем.", 
  answer: "Б) организованная", 
  options: [
    "А) организована", 
    "",
    "Б) организованная",
    ""
  ]
},
  {
  numb: 27, 
  question: "Книга уже ... Её можно сдать в библиотеку.",  
  answer: "Б) прочитана", 
  options: [
    "А) прочитанная", 
    "",
    "Б) прочитана",
    "" 
  ]
},
  { 
  numb: 28,
  question: "Это здание ... в начале XX века.",  
  answer: "А) построено",
  options: [ 
    "А) построено", 
    "",
    "Б) построенное",
    "" 
  ]
},
{
  numb: 29,
  question: "Я хотела купить цветы, но магазин был ...",  
  answer: "Б) закрыт", 
  options: [
    "А) закрытый", 
    "",
    "Б) закрыт",
    "" 
  ]
},
{
  numb: 30,
  question: "Анна принесла сочинение, ... ею ночью.",  
  answer: "Б) написанное",
  options: [
    "А) написано", 
    "",
    "Б) написанное",
    "" 
  ]
},
{
  numb: 31,
  question: "Выставка будет ... завтра.", 
  answer: "Б) открыта", 
  options: [
    "А) открытая",  
    "",
    "Б) открыта",
    ""
  ]
},
{
  numb: 32,
  question: "Посмотрите, вся работа уже ...",  
  answer: "Б) сделана",  
  options: [
    "А) сделанная",  
    "",
    "Б) сделана",
    ""
  ]
},
{
  numb: 33,
  question: "В этом изложении ошибки ещё не ... ", 
  answer: "А) исправлены", 
  options: [
    "А) исправлены",  
    "",
    "Б) исправленные",
    ""
  ]
},
{
  numb: 34,
  question: "В аудитории лежит куртка, ... каким-то студентом.",  
  answer: "Б) забытая",
  options: [ 
    "А) забыта",  
    "",
    "Б) забытая",
    ""
  ]
},
{
  numb: 35,
  question: "Эта книга была ... моей бабушкой.",  
  answer: "Б) переведена", 
  options: [
    "А) переведённая ",  
    "",
    "Б) переведена",
    "" 
  ]
},
{
  numb: 36,
  question: "Татьяна показала нам пальто, ... ею сегодня.", 
  answer: "Б) купленное", 
  options: [
    "А) куплено ",  
    "",
    "Б) купленное",
    "" 
  ]
},
{
  numb: 37,
  question: "Этот портрет ... известным художником. ", 
  answer: "В) нарисован",
  options: [
    "А) нарисовал",  
    "Б) нарисованный",
    "В) нарисован",
    "" 
  ]
}, 
{
  numb: 38,
  question: "Зимний дворец ... по проекту архитектора Ф.Б. Растрелли.",  
  answer: "А) построен", 
  options: [ 
    "А) построен",  
    "Б) построенный",
    "В) построил",
    "" 
  ]
},
{
  numb: 39,
  question: "Вся работа была ... вовремя.", 
  answer: "А) сделана",  
  options: [
    "А) сделана",   
    "Б) сделала",
    "В) сделавшая",
    ""
  ]
},
{
  numb: 40,
  question: "Этот профессор ... лекцию завтра в 10 часов.", 
  answer: "В) будет читать", 
  options: [
    "А) прочитавший",   
    "Б) будет прочитан",
    "В) будет читать",
    ""
  ]
},
{
  numb: 41,
  question: "Картина ... моим дедом.",  
  answer: "Б) была куплена", 
  options: [
    "А) купленная",   
    "Б) была куплена",
    "В) купил",
    "" 
  ]
}, 
{
  numb: 42,
  question: "Это письмо я ... завтра.",  
  answer: "А) пошлю",  
  options: [
    "А) пошлю",   
    "Б) будет послано",
    "В) послала",
    ""
  ]
},
{
  numb: 43,
  question: "Я читаю книгу, ... мне братом.",  
  answer: "Б) подаренную",
  options: [
    "А) подарившую", 
    "Б) подаренную",
    "В) была подарена",
    ""
  ]
},
{
  numb: 44,
  question: "Задача ... Антоном за 5 минут.", 
  answer: "А) была решена", 
  options: [
    "А) была решена", 
    "Б) решённая",
    "В) решил",
    ""
  ]
},
  { 
  numb: 45,
  question: "А.С. Пушкин - поэт, ... всеми русскими. ", 
  answer: "В) любимый", 
  options: [ 
    "А) любящий", 
    "Б) любят",
    "В) любимый",
    ""
  ]
},
  {
  numb: 46, 
  question: "Студент, ... на вопрос правильно, получил пятёрку.", 
  answer: "В) ответивший", 
  options: [
    "А) ответит", 
    "Б) отвечает",
    "В) ответивший",
    ""
  ]
},
  {
  numb: 47, 
  question: "Все книги ... в библиотеку.",  
  answer: "А) сданы",  
  options: [
    "А) сданы",
    "Б) сдавшие",
    "В) сданные",
    ""
  ]
},
  { 
  numb: 48,
  question: "Антон постучал в ... дверь.",  
  answer: "Б) закрытую",
  options: [ 
    "А) закрывшую",
    "Б) закрытую",
    "В) закрывающую",
    ""
  ]
},
{
  numb: 49,
  question: "..., строители продолжили работу.",  
  answer: "Б) отдохнув", 
  options: [
    "А) отдыхая",
    "",
    "Б) отдохнув",
    ""
  ]
},
{
  numb: 50,
  question: "... задание, студенты начали делать упражнение.",  
  answer: "А) прочитав ",
  options: [
    "А) прочитав ",
    "",
    "Б) читая",
    ""
  ]
},
{
  numb: 51,
  question: "... домой, я встретила в троллейбусе свою подругу.",  
  answer: "Б) возвращаясь", 
  options: [
    "А) вернувшись ", 
    "",
    "Б) возвращаясь",
    "" 
  ]
}, 
{
  numb: 52,
  question: "..., отец всегда ложится отдыхать.",  
  answer: "А) пообедав ",  
  options: [
    "А) пообедав ", 
    "",
    "Б) обедая",
    ""
  ]
},
{
  numb: 53,
  question: "... минуту, Татьяна уверенно отве тила на вопрос.",  
  answer: "Б) подумав",
  options: [
    "А) думая ", 
    "",
    "Б) подумав",
    ""
  ]
},
{
  numb: 54,
  question: "Студент сдал сочинение, ... написать своё имя.", 
  answer: "А) забыв", 
  options: [
    "А) забыв", 
    "",
    "Б) забывая",
    ""
  ]
},
  { 
  numb: 55,
  question: "... в Россию, Дзян обещал родителям часто писать.", 
  answer: "А) уезжая ", 
  options: [ 
    "А) уезжая ",
    "", 
    "Б) уехав",
    ""
  ]
},
  {
  numb: 56, 
  question: "... ужин, мама позвала всех к столу.", 
  answer: "Б) приготовив", 
  options: [
    "А) готовя",
    "", 
    "Б) приготовив",
    ""
  ]
},
  {
  numb: 57, 
  question: "Хорошо ... иностранный язык, ты сможешь работать переводчиком.",  
  answer: "Б) изучив",  
  options: [
    "А) изучая ",
    "", 
    "Б) изучив",
    ""
  ]
},
  { 
  numb: 58,
  question: "... новый грамматический материал, преподаватель писал на доске примеры.",  
  answer: "Б) объясняя",
  options: [ 
    "А) объяснив ",
    "", 
    "Б) объясняя",
    ""
  ]
},
{
  numb: 59,
  question: "... все экзамены, студенты уехали на каникулы.",  
  answer: "Б) сдав", 
  options: [
    "А) сдавая",
    "",
    "Б) сдав",
    ""
  ]
},
{
  numb: 60,
  question: "... в Петербурге, Том часто ходил в Эрмитаж.",  
  answer: "А) живя",
  options: [
    "А) живя",
    "",
    "Б) прожив",
    ""
  ]
},
{
  numb: 61,
  question: "... ключ, Лена не смогла войти в дом.", 
  answer: "Б) потеряв ", 
  options: [
    "А) теряя",
    "",
    "Б) потеряв ",
    ""
  ]
},
{
  numb: 62,
  question: "... стать врачом, Татьяна поступила в медицинский институт.",  
  answer: "Б) решив",  
  options: [
    "А) решая",
    "",
    "Б) решив",
    ""
  ]
},
{
  numb: 63,
  question: "... словарь подруге, Мария не смогла сделать домашнее задание.", 
  answer: "А) отдав ", 
  options: [
    "А) отдав ", 
    "", 
    "Б) отдавая",
    ""
  ]
},
{
  numb: 64,
  question: "... на вопрос, студент сделал 4 ошибки.",  
  answer: "А) отвечая",
  options: [ 
    "А) отвечая", 
    "", 
    "Б) ответив",
    ""
  ]
},
{
  numb: 65,
  question: "... душ, Дзян пошёл завтракать.",  
  answer: "Б) приняв", 
  options: [
    "А) принимая", 
    "", 
    "Б) приняв",
    ""
  ]
},
{
  numb: 66,
  question: "... посуду, Елена разбила чашку.", 
  answer: "Б) убирая", 
  options: [
    "А) убрав", 
    "", 
    "Б) убирая",
    ""
  ]
},
{
  numb: 67,
  question: "... новости, Джина выключила радио. ", 
  answer: "А) послушав",
  options: [
    "А) послушав",  
    "",
    "Б) слушая",
    ""
  ]
}, 
{
  numb: 68,
  question: "... письмо от мамы, Марта сразу же начала его читать.",  
  answer: "Б) получив", 
  options: [
    "А) получая",  
    "",
    "Б) получив",
    ""
  ]
},
{
  numb: 69,
  question: "... к дому, машина остановилась.", 
  answer: "Б) подъехав", 
  options: [
    "А) подъезжая",  
    "",
    "Б) подъехав",
    ""
  ]
},
{
  numb: 70,
  question: "... мимо, Андрей с нами поздоровался.", 
  answer: "Б) проходя", 
  options: [
    "А) пройдя",  
    "",
    "Б) проходя",
    ""
  ]
},

];