// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Нужно ... из текста все прилагательные.",
  answer: "Б) выписать",
  options: [
    "А) списать",
    "Б) выписать",
    "В) дописать",
    "Г) написать"
  ]
},
  { 
  numb: 2,
  question: "Я плохо помню этот роман и хочу..... его.",
  answer: "Г) перечитать", 
  options: [ 
    "А) вычитать  ", 
    "Б) прочитать ", 
    "В) дочитать ", 
    "Г) перечитать" 
  ]
},
  {
  numb: 3, 
  question: "Брюки очень длинные. Я попросила маму ... их.", 
  answer: "Г) подшить", 
  options: [
    "А) сшить",
    "Б) пришить",
    "В) ушить	",
    "Г) подшить"

  ]
},
  {
  numb: 4,
  question: "Наша команда ... этот матч вничью.", 
  answer: "Б) сыграла",  
  options: [
    "А) выиграла", 
    "Б) сыграла", 
    "В) доиграла", 
    "Г) проиграла"  
  ]
},
  {
  numb: 5,
  question: "Брат не хотел ехать в горы, но я ... его.",  
  answer: "Б) уговорила", 
  options: [ 
    "А) разговорила", 
    "Б) уговорила",
    "В) приговорила", 
    "Г) отговорила"  
  ]
},
{
  numb: 6,
  question: "Ребёнок заболел, нужно... температуру.", 
  answer:  "Г) измерить",  
  options: [
    "А) перемерить", 
    "Б) отмерить", 
    "В) замерить",
    "Г) измерить" 
  ]
},
{
  numb: 7,
  question: "Из дома... огромная собака.",  
  answer: "В) выскочила", 
  options: [
    "А) соскочила	",
    "Б) вскочила	", 
    "В) выскочила",
    "Г) подскочила"  
  ]
},
{
  numb: 8,
  question: "Небо было безоблачным,... солнце.", 
  answer: "А) светило",
  options: [
    "А) светило", 
    "Б) высветило", 
    "В) засветило",
    "Г) подсветило"  
  ]
},
{
  numb: 9,
  question: "Мать хочет ... сына к порядку.", 
  answer: "Б) приучить",  
  options: [
    "А) доучить ", 
    "Б) приучить",  
    "В) выучить", 
    "Г) научить"  
  ]
},
{
  numb: 10,
  question: "Девочка ... немного молока из стакана.", 
  answer: "А) отпила",
  options: [
    "А) отпила", 
    "Б) допила", 
    "В) перепила", 
    "Г) запила" 
  ]
},
{
  numb: 11,
  question: "Кто-то толкнул меня, и я ... кофе на платье.", 
  answer: "В) пролила", 
  options: [ 
    "А) отлила", 
    "Б) налила",
    "В) пролила", 
    "Г) перелила"  
  ]
},
{
  numb: 12,
  question: "Он очень рассердился и с трудом ... себя.",  
  answer: "Б) сдержал",  
  options: [
    "А) выдержал", 
    "Б) сдержал", 
    "В) поддержал", 
    "Г) задержал" 
  ]
},
{
  numb: 13,
  question: "Некоторые спортсмены перед соре внованиями ... вес.", 
  answer: "Б) сгоняют",  
  options: [
    "А) угоняют", 
    "Б) сгоняют",  
    "В) выгоняют", 
    "Г) перегоняют" 
  ]
},
{
  numb: 14,
  question: "Сын хотел пойти в лыжный поход, но родители не... его.", 
  answer: "А) отпустили",
  options: [
    "А) отпустили",  
    "Б) допустили",  
    "В) запустили", 
    "Г) впустили"   
  ] 
}, 
{
  numb: 15,
  question: "На перекрёстке машина... пешехода.", 
  answer: "В) сбила", 
  options: [
    "А) подбила",  
    "Б) убила",  
    "В) сбила", 
    "Г) выбила"    
  ]
},
{
  numb: 16,
  question: "Эта картина.... к себе моё внимание. ", 
  answer: "А) привлекла",
  options: [
    "А) привлекла", 
    "Б) отвлекла", 
    "В) завлекла",  
    "Г) увлекла"  
  ]
},
{
  numb: 17,
  question: "Нож был очень острый, и мама ... палец.", 
  answer: "В) порезала", 
  options: [
    "А) зарезала",  
    "Б) срезала",  
    "В) порезала",  
    "Г) вырезала"  
  ]
},
{
  numb: 18,
  question: "Подул ветер, стало холодно, и я ... куртку.", 
  answer: "А) застегнул",
  options: [ 
    "А) застегнул",  
    "Б) пристегнул",
    "В) отстегнул",  
    "Г) расстегнул"   
  ]
},
{
  numb: 19,
  question: "Я попросила продавца.... покупку в подарочную бумагу.",  
  answer: "Б) завернуть",  
  options: [
    "А) свернуть",  
    "Б) завернуть",  
    "В) перевернуть",  
    "Г) отвернуть"  
  ]
},
{
  numb: 20, 
  question: "Студент прекрасно отвечал и ни разу не ....",  
  answer: "А) сбился",  
  options: [
    "А) сбился", 
    "Б) выбился",   
    "В) отбился",  
    "Г) пробился"   
  ]
},
{
  numb: 21,
  question: "Пора... к работе.",  
  answer: "В) приступать", 
  options: [
    "А) отступать",   
    "Б) наступать",  
    "В) приступать",  
    "Г) выступать"     
  ]
}, 
{
  numb: 22,
  question: "Мы ещё не .... обед.",  
  answer: "В) заказали",  
  options: [
    "А) приказали",   
    "Б) сказали",   
    "В) заказали",  
    "Г) указали"     
  ]
},
{
  numb: 23,
  question: "Моего брата недавно... в армию.",  
  answer: "А) призвали",
  options: [
    "А) призвали",  
    "Б) назвали", 
    "В) отозвали",  
    "Г) вызвали"    
  ]
},
{
  numb: 24,
  question: "Этот кандидат не .... на выборах нужного количества голосов.", 
  answer: "А) набрал", 
  options: [
    "А) набрал", 
    "Б) отобрал", 
    "В) забрал", 
    "Г) выбрал",  
  ]
},
  { 
  numb: 25,
  question: "Ирина завтра уезжает, она уже ... вещи в чемодан.", 
  answer: "В) сложила", 
  options: [ 
    "А) разложила",  
    "Б) отложила", 
    "В) сложила", 
    "Г) вложила"   
  ]
},
  {
  numb: 26, 
  question: "Кто ... за ребёнком, когда мама на работе?", 
  answer: "В) присматривает", 
  options: [
    "А) высматривает", 
    "Б) отсматривает",
    "В) присматривает", 
    "Г) досматривает"   
  ]
},
  {
  numb: 27, 
  question: "Ольга ... сад розами.",  
  answer: "А) засадила", 
  options: [
    "А) засадила",  
    "Б) посадила",  
    "В) подсадила", 
    "Г) отсадила"  
  ]
},
  { 
  numb: 28,
  question: "Никто не ... загадку.",  
  answer: "Б) отгадал",
  options: [ 
    "А) прогадал", 
    "Б) отгадал",
    "В) погадал", 
    "Г) нагадал"   
  ]
},
{
  numb: 29,
  question: "Нам ... большое домашнее задание.",  
  answer: "Б) задали", 
  options: [
    "А) выдали",
    "Б) задали",  
    "В) сдали",
    "Г) продали"   
  ]
},
{
  numb: 30,
  question: "Вода в реке поднялась и .... нашу лодку.",  
  answer: "А) смыла",
  options: [
    "А) смыла", 
    "Б) намыла", 
    "В) вымыла",
    "Г) умыла"  
  ]
},

];