// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "Д.И. Менделеев - ... русский химик.",
    answer: "А) великий",
    options: [
      "А) великий",
      "",
      "Б) величественный",
      "",
    ]
  },
    { 
    numb: 2,
    question: "... здание собора видно издалека.",
    answer: "Б) Величественное",
    options: [ 
      "А) Великое", 
      "", 
      "Б) Величественное", 
      ""  
    ]
  },
    {
    numb: 3, 
    question: "После ссоры у Андрея был ... вид.",
    answer: "А) виноватый",
    options: [
      "А) виноватый", 
      "",
      "Б) виновный",
      ""  
    ]
  },
    {
    numb: 4,
    question: "Суд признал обвиняемого ...", 
    answer: "Б) виновным",  
    options: [
      "А) виноватым", 
      "", 
      "Б) виновным", 
      ""  
    ]
  },
    {
    numb: 5,
    question: "Я не ..., что опоздал на встречу.", 
    answer: "А) виноват",
    options: [ 
      "А) виноват", 
      "",
      "Б) виновен",  
      "" 
    ]
  },
  {
    numb: 6,
    question: "Завтра концерт, поэтому сегодня будет ... репетиция.", 
    answer: "А) генеральная", 
    options: [
      "А) генеральная",
      "", 
      "Б) генеральская",
      "" 
    ]  
  },
  {
    numb: 7,
    question: "Я не знала, что Анна - ... дочь.", 
    answer: "Б) генеральская", 
    options: [
      "А) генеральная",
      "",  
      "Б) генеральская",
      ""  
    ]
  },
  {
    numb: 8,
    question: "Перед Новым годом мы всегда делаем ... уборку.",
    answer: "А) генеральную", 
    options: [
      "А) генеральную", 
      "", 
      "Б) генеральскую",
      ""   
    ]
  },
  {
    numb: 9,
    question: "... план реконструкции исторического города принят.", 
    answer: "А) Генеральный",  
    options: [
      "А) Генеральный", 
      "",  
      "Б) Генеральский", 
      ""   
    ]
  },
  {
    numb: 10,
    question: "Самолёт доставил в пострадавший от наводнения район ... помощь.", 
    answer: "Б) гуманитарную",
    options: [
      "А) гуманистическую",  
      "", 
      "Б) гуманитарную", 
      "" 
    ]
  },
  {
    numb: 11,
    question: "Он очень ... человек.", 
    answer: "А) гуманный", 
    options: [ 
      "А) гуманный", 
      "",
      "Б) гуманистический", 
      ""   
    ]
  },
  {
    numb: 12,
    question: "В университете Ольга изучает ... науки.", 
    answer: "А) гуманитарные",  
    options: [
      "А) гуманитарные", 
      "", 
      "Б) гуманистические ", 
      ""  
    ]
  },
  {
    numb: 13,
    question: "Между этими двумя странами существуют давние ... отношения.", 
    answer: "А) экономические",  
    options: [
      "А) экономические", 
      "",  
      "Б) экономичные", 
      ""  
    ]
  },
  {
    numb: 14,
    question: "Моя подруга очень ... хозяйка.", 
    answer: "Б) экономная", 
    options: [
      "А) экономичная",  
      "",  
      "Б) экономная", 
      ""    
    ]
  }, 
  {
    numb: 15,
    question: "На встречу с президентом страны были приглашены ... работники.", 
    answer: "А) дипломатические",  
    options: [
      "А) дипломатические",  
      "",  
      "Б) дипломатичные", 
      ""    
    ]
  },
  {
    numb: 16,
    question: "Он давно оставил ... работу и сейчас на пенсии.", 
    answer: "А) дипломатическую ",
    options: [
      "А) дипломатическую ", 
      "",  
      "Б) дипломную",  
      ""  
    ]
  },
  {
    numb: 17,
    question: "Мария очень ... человек.", 
    answer: "Б) дипломатичный",  
    options: [
      "А) дипломатический ",  
      "",  
      "Б) дипломатичный",  
      ""   
    ]
  },
  {
    numb: 18,
    question: "Наше ... бюро было создано 20 лет назад.", 
    answer: "Б) конструкторское", 
    options: [ 
      "А) конструктивное",  
      "",
      "Б) конструкторское",  
      ""    
    ]
  },
  {
    numb: 19,
    question: "Его ... помощь дала возможность лучше решить проблему.",  
    answer: "А) конструктивная ",   
    options: [
      "А) конструктивная ",  
      "",  
      "Б) конструкторская",  
      ""   
    ]
  },
  {
    numb: 20, 
    question: "Он оказался ... свидетелем преступления.",  
    answer: "Б) единственным",   
    options: [
      "А) единичным ", 
      "",   
      "Б) единственным",  
      ""   
    ]
  },
  {
    numb: 21,
    question: "На небе ни ... облачка.",  
    answer: "А) единого",  
    options: [
      "А) единого",   
      "",  
      "Б) единственного",  
      ""    
    ]
  }, 
  {
    numb: 22,
    question: "Сентябрь в этом году был очень ... ",  
    answer: "Б) дождливый",   
    options: [
      "А) дождевой",   
      "",   
      "Б) дождливый",  
      ""     
    ]
  },
  {
    numb: 23,
    question: "Полезно мыть голову ... водой.",  
    answer: "А) дождевой ", 
    options: [
      "А) дождевой ",  
      "", 
      "Б) дождливой",  
      ""   
    ]
  },
  {
    numb: 24,
    question: "Меня испугал его ... взгляд.", 
    answer: "Б) враждебный",  
    options: [
      "А) вражеский", 
      "", 
      "Б) враждебный", 
      "", 
    ]
  },
    { 
    numb: 25,
    question: "В результате тяжёлых боёв ... войска отступили.", 
    answer: "А) вражеские ",
    options: [ 
      "А) вражеские ",  
      "", 
      "Б) враждебные", 
      ""  
    ]
  },
    {
    numb: 26, 
    question: "Это ... фонетическая ошибка для испаноговорящих.", 
    answer: "А) типичная ",  
    options: [
      "А) типичная ", 
      "",
      "Б) типовая", 
      ""  
    ]
  },
    {
    numb: 27, 
    question: "Новый район застроен ... зданиями.",  
    answer: "А) типовыми ", 
    options: [
      "А) типовыми ",  
      "",  
      "Б) типичными",  
      ""  
    ]
  },
    { 
    numb: 28,
    question: "Мне нужно купить большой ... горшок.",  
    answer: "А) цветочный ", 
    options: [ 
      "А) цветочный ", 
      "",
      "Б) цветовой", 
      ""   
    ]
  },
  {
    numb: 29,
    question: "Сестра нарисовала этот рисунок ... карандашами.",  
    answer: "Б) цветными",  
    options: [
      "А) цветовыми",
      "",  
      "Б) цветными",
      ""  
    ]
  },
  {
    numb: 30,
    question: "На полу лежал ... ковёр.",  
    answer: "Б) цветистый ",
    options: [
      "А) цветовой", 
      "", 
      "Б) цветистый ",
      ""   
    ]
  },
  {
    numb: 31,
    question: "Мой друг ... во всём.", 
    answer: "Б) удачлив",  
    options: [
      "А) удачен ", 
      "",  
      "Б) удачлив", 
      ""   
    ]
  },
  {
    numb: 32,
    question: "Я купила ... обои: очень красивые и недорогие.",  
    answer: "А) удачные",  
    options: [ 
      "А) удачные", 
      "",  
      "Б) удачливые",   
      ""  
    ]
  },
  {
    numb: 33,
    question: "Виктор предложил ... способ работы над проектом.", 
    answer: "Б) эффективный",  
    options: [
      "А) эффектный",  
      "",  
      "Б) эффективный",  
      ""   
    ]
  },
  {
    numb: 34,
    question: "Светлана пришла в гости в ... платье.",  
    answer: "А) эффектном", 
    options: [ 
      "А) эффектном",  
      "",
      "Б) эффективном", 
      ""    
    ]
  },
  {
    numb: 35,
    question: "Выступление фигуристов было ...",  
    answer: "А) эффектным",  
    options: [
      "А) эффектным", 
      "",  
      "Б) эффективным",  
      ""   
    ]
  },
  {
    numb: 36,
    question: "Мы шли по ... берегу и любовались закатом.", 
    answer: "А) песчаному ", 
    options: [
      "А) песчаному ",  
      "",  
      "Б) песочному", 
      "" 
    ]
  },
  {
    numb: 37,
    question: "На территории университета есть ... комплекс. ", 
    answer: "Б) гостиничный",
    options: [ 
      "А) гостевой",  
      "",  
      "Б) гостиничный", 
      ""    
    ] 
  }, 
  {
    numb: 38,
    question: "Ты можешь остаться у нас и переночевать в ... комнате.",  
    answer: "А) гостевой",  
    options: [
      "А) гостевой",  
      "",  
      "Б) гостиничной", 
      ""     
    ]
  },
  {
    numb: 39,
    question: "Ты всегда ... гость в нашем доме.", 
    answer: "А) желанный", 
    options: [
      "А) желанный", 
      "", 
      "Б) желательный",  
      ""  
    ]
  },
  {
    numb: 40,
    question: "Сентябрь - ... срок окончания этой работы.", 
    answer: "Б) желательный", 
    options: [
      "А) желанный",  
      "",  
      "Б) желательный",  
      ""  
    ]
  },

];