// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "Не стой на пороге: ... уходи, ... давай пройдём в комнату.",
    answer: "А) или ... или ...", 
    options: [
      "А) или ... или ...",
      "Б) то ли ... то ли ...",
      "В) то ... то ...",
      "Г) ни ... ни ...", 
    ]
  },
    { 
    numb: 2,
    question: "Никто не хочет мириться: ... Елена ему не звонит, ... он ей. ",
    answer: "В) ни ... ни ...", 
    options: [ 
      "А) то ли ... то ли ...", 
      "Б) и ... и ....", 
      "В) ни ... ни ...", 
      "Г) не то ... не то ..."  
    ]
  },
    {
    numb: 3, 
    question: "У Ольги всё в порядке: ... работу нашла, ... муж поправился. ",
    answer: "Б) и ... и ...", 
    options: [
      "А) то ... то ...", 
      "Б) и ... и ...",
      "В) или ...  или ...",
      "Г) то ли ... то ли ..."  
    ]
  },
    {
    numb: 4,
    question: "Свадьба почему-то расстроилась: ... жених виноват, ...невеста передумала. ", 
    answer: "Г) не то ... не то ...",  
    options: [
      "А) то ... то ...", 
      "Б) ни ... ни .... ", 
      "В) и ... и ...", 
      "Г) не то ... не то ..."  
    ]
  },
    {
    numb: 5,
    question: "Я не знаю, где перчатки: ... я их потеряла, ... муж убрал в шкаф.", 
    answer: "А) то ли ... то ли ...", 
    options: [ 
      "А) то ли ... то ли ...", 
      "Б) то ... то ...",
      "В) и ... и ...",  
      "Г) ни ... ни ..." 
    ]
  },
  {
    numb: 6,
    question: "Он так и не смог отдохнуть летом: ... его мама болела, ... дедушка сломал ногу.", 
    answer: "А) то ... то ...", 
    options: [
      "А) то ... то ...",
      "Б) или ... или ...", 
      "В) то ли ... то ли ...",
      "Г) не то ... не то ..."  
    ]  
  },
  {
    numb: 7,
    question: "Я предлагаю два варианта: ... ты едешь с бабушкой, ... бабушка остаётся здесь.", 
    answer: "Б) или ... или ...", 
    options: [
      "А) то ... то ...",
      "Б) или ... или ...",  
      "В) то ли ... то ли ...",
      "Г) не то ... не то ..."  
    ]
  },
  {
    numb: 8,
    question: "Погода менялась в течение дня: … шёл дождь, … выглядывало солнце.",
    answer: "Г) то ... то ...", 
    options: [
      "А) не то ... не то ...", 
      "Б) то ли ... то ли ...", 
      "В) или ... или ...",
      "Г) то ... то ..."   
    ]
  },
  {
    numb: 9,
    question: "Я не помню, чем кончился фильм: ... герой спасся, ... его убили.", 
    answer: "А) то ли ... то ли ...",  
    options: [
      "А) то ли ... то ли ...", 
      "Б) то ... то ...",  
      "В) и ... и ...", 
      "Г) ни ... ни ..."   
    ]
  },
  {
    numb: 10,
    question: "Никто точно не знает, ... он украл, ... у него украли.", 
    answer: "В) не то ... не то ...",
    options: [
      "А) ни ... ни ...",  
      "Б) и ... и ...", 
      "В) не то ... не то ...", 
      "Г) то ... то ..." 
    ]
  },
  {
    numb: 11,
    question: "Ему ... в отпуск поехать хочется, ... денег нет.", 
    answer: "А) и ... да ...", 
    options: [ 
      "А) и ... да ...", 
      "Б) или ... или ...",
      "В) то ... то ...", 
      "Г) то ли ... то ли ..."   
    ]
  },
  {
    numb: 12,
    question: "Ему ... в отпуск поехать хочется, ... работу жаль бросать.", 
    answer: "Б) и ... и ...",  
    options: [
      "А) не то ... не то ... ", 
      "Б) и ... и ...", 
      "В) то ли ... то ли ...", 
      "Г) или ... или ..."  
    ]
  },
  {
    numb: 13,
    question: "Он собирается стать стоматологом, ... офтальмологом.", 
    answer: "Б) или ... или ...",  
    options: [
      "А) ни ... ни ...", 
      "Б) или ... или ...",  
      "В) то ... то ...", 
      "Г) и ... да ..."  
    ]
  },
  {
    numb: 14,
    question: "Перед крыльцом пробежал ... ёжик, ... мышонок.", 
    answer: "В) не то ... не то ...", 
    options: [
      "А) то ... то ...",  
      "Б) ни ... ни ...",  
      "В) не то ... не то ...", 
      "Г) и ... и ..."    
    ]
  }, 
  {
    numb: 15,
    question: "Она покрасила волосы ... в рыжий, ... в каштановый цвет.", 
    answer: "Б) не то ... не то ...",  
    options: [
      "А) и ... и ...",  
      "Б) не то ... не то ...",  
      "В) то ... то ...", 
      "Г) и ... да ..."    
    ]
  },
  {
    numb: 16,
    question: "Ему ... плакать хочется, ... плакать нельзя.", 
    answer: "В) и ... да ...",
    options: [
      "А) или ... или ...", 
      "Б) то ли ... то ли ...",  
      "В) и ... да ...",  
      "Г) то ... то ..."  
    ]
  },
  {
    numb: 17,
    question: "Эту симфонию сочинил ... Бетховен, ... Шостакович.", 
    answer: "Б) то ли ... то ли ...",  
    options: [
      "А) и ... и ...",  
      "Б) то ли ... то ли ...",  
      "В) то ... то ...",  
      "Г) и ... да ..."   
    ]
  },
  {
    numb: 18,
    question: "Узнав, что она победила, она ... плакала, ... смеялась.", 
    answer: "А) то ... то ...", 
    options: [ 
      "А) то ... то ...",  
      "Б) и ... да ...",
      "В) ни ... ни ...",  
      "Г) то ли ... то ли ..."    
    ]
  },
  {
    numb: 19,
    question: "Посмотри, какая погода: ... дождь, ... ветер.",  
    answer: "Б) и ... и ...",   
    options: [
      "А) то ли ... то ли ...",  
      "Б) и ... и ...",  
      "В) не то ... не то ...",  
      "Г) и ... да ..."   
    ]
  },
  {
    numb: 20, 
    question: "В результате она не успела ... в театр, ... на собрание.",  
    answer: "Г) ни ... ни ...",   
    options: [
      "А) и ... и ...", 
      "Б) то ... то ...",   
      "В) не то ... не то ...",  
      "Г) ни ... ни ..."   
    ]
  },

];