// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Я ещё не..., что подарить брату.",
  answer: "В) придумал",
  options: [
    "А) раздумал",
    "Б) передумал",
    "В) придумал",
    "Г) вдумался"
  ]
},
  { 
  numb: 2,
  question: ". Ко мне приехал друг детства, и мы ... всю ночь.",
  answer: "В) проговорили", 
  options: [ 
    "А) поговорили", 
    "Б) договорились", 
    "В) проговорили", 
    "Г) наговорились" 
  ]
},
  {
  numb: 3, 
  question: "Его ... из университета за неуспе ваемость.", 
  answer: "Б) исключили", 
  options: [
    "А) заключили",
    "Б) исключили",
    "В) отключили",
    "Г) переключились"

  ]
},
  {
  numb: 4,
  question: "Она ... его своей добротой.", 
  answer: "А) подкупила",  
  options: [
    "А) подкупила", 
    "Б) накупила", 
    "В) раскупила", 
    "Г) выкупила"  
  ]
},
  {
  numb: 5,
  question: "Чай остыл, и я ... его.",  
  answer: "Б) вылил", 
  options: [ 
    "А) полил", 
    "Б) вылил",
    "В) налил", 
    "Г) залил"  
  ]
},
{
  numb: 6,
  question: "Он ... таблетку водой.", 
  answer:  "А) запил",  
  options: [
    "А) запил", 
    "Б) распил", 
    "В) допил",
    "Г) выпил" 
  ]
},
{
  numb: 7,
  question: "Вчера его... из больницы.",  
  answer: "А) выписали", 
  options: [
    "А) выписали",
    "Б) списали", 
    "В) записали",
    "Г) прописали"  
  ]
},
{
  numb: 8,
  question: "На пальто нет пуговицы, надо ... её.", 
  answer: "Б) пришить",
  options: [
    "А) подшить", 
    "Б) пришить", 
    "В) зашить",
    "Г) перешить"  
  ]
},
{
  numb: 9,
  question: "Машина ... в дерево.", 
  answer: "Б) врезалась",  
  options: [
    "А) срезала", 
    "Б) врезалась",  
    "В) изрезала", 
    "Г) прорезалась"  
  ]
},
{
  numb: 10,
  question: "В детстве мой брат .... фантастикой.", 
  answer: "В) зачитывался",
  options: [
    "А) прочитывал", 
    "Б) вчитывался", 
    "В) зачитывался", 
    "Г) перечитывал" 
  ]
},
{
  numb: 11,
  question: "Дочь ... отца купить ей собаку.", 
  answer: "В) упросила", 
  options: [ 
    "А) допросила", 
    "Б) спросила",
    "В) упросила", 
    "Г) выпросила"  
  ]
},
{
  numb: 12,
  question: "Мария долго ... альбом с репродукциями.",  
  answer: "В) рассматривала",  
  options: [
    "А) высматривала", 
    "Б) присматривалась", 
    "В) рассматривала", 
    "Г) засматривалась" 
  ]
},
{
  numb: 13,
  question: "Андрей целый месяц... гриппом.", 
  answer: "В) проболел",  
  options: [
    "А) разболелся", 
    "Б) заболел",  
    "В) проболел", 
    "Г) приболел" 
  ]
},
{
  numb: 14,
  question: "Наша футбольная команда ... вчера команду Франции.", 
  answer: "В) обыграла",
  options: [
    "А) выиграла",  
    "Б) сыграла",  
    "В) обыграла", 
    "Г) проиграла"   
  ] 
}, 
{
  numb: 15,
  question: "Мама старается ... ребёнка класть вещи на место.", 
  answer: "Г) приучить", 
  options: [
    "А) выучить",  
    "Б) доучить",  
    "В) научить", 
    "Г) приучить"    
  ]
},
{
  numb: 16,
  question: "Учитель ... ученикам о контрольной работе.", 
  answer: "Б) напомнил",
  options: [
    "А) запомнил", 
    "Б) напомнил", 
    "В) упомнил",  
    "Г) вспомнил"  
  ]
},
{
  numb: 17,
  question: "Я не смогла ... кофейное пятно с блузки.", 
  answer: "А) отстирать", 
  options: [
    "А) отстирать",  
    "Б) застирать",  
    "В) перестирать",  
    "Г) выстирать"  
  ]
},
{
  numb: 18,
  question: "Пора ... эти мысли из головы.", 
  answer: "А) выбросить",
  options: [ 
    "А) выбросить",  
    "Б) отбросить",
    "В) набросить",  
    "Г) сбросить"   
  ]
},
{
  numb: 19,
  question: "Мы ... два стола и сели все вместе.",  
  answer: "Г) сдвинули",  
  options: [
    "А) задвинули",  
    "Б) раздвинули",  
    "В) отодвинули",  
    "Г) сдвинули"  
  ]
},
{
  numb: 20, 
  question: "Боксёр успел... от удара.",  
  answer: "Б) уклониться",  
  options: [
    "А) наклониться", 
    "Б) уклониться",   
    "В) отклониться",  
    "Г) склониться"   
  ]
},
{
  numb: 21,
  question: "Всю комнату ... мебелью.",  
  answer: "Г) заставили", 
  options: [
    "А) поставили",   
    "Б) вставили",  
    "В) переставили",  
    "Г) заставили"     
  ]
}, 
{
  numb: 22,
  question: "Он принял лекарство и ... его водой. ",  
  answer: "А) запил",  
  options: [
    "А) запил",   
    "Б) выпил",   
    "В) отпил",  
    "Г) попил"     
  ]
},
{
  numb: 23,
  question: "За лето мои волосы ... на солнце.",  
  answer: "А) выгорели",
  options: [
    "А) выгорели",  
    "Б) загорели", 
    "В) прогорели",  
    "Г) сгорели"    
  ]
},
{
  numb: 24,
  question: "На экзамене профессор... студентам много вопросов.", 
  answer: "В) задавал", 
  options: [
    "А) отдавал", 
    "Б) сдавал", 
    "В) задавал", 
    "Г) передавал",  
  ]
},
  { 
  numb: 25,
  question: "Вы уже ... свои ошибки в контрольной работе?", 
  answer: "Г) исправили", 
  options: [ 
    "А) отправили",  
    "Б) направили", 
    "В) заправили", 
    "Г) исправили"   
  ]
},
  {
  numb: 26, 
  question: "... мне, пожалуйста, кусочек торта.", 
  answer: "Б) Отрежь", 
  options: [
    "А) Срежь", 
    "Б) Отрежь",
    "В) Перережь", 
    "Г) Нарежь"   
  ]
},
  {
  numb: 27, 
  question: "Когда мы ехали по шоссе, нас ... экскурсионный автобус.",  
  answer: "Б) обогнал", 
  options: [
    "А) выгнал",  
    "Б) обогнал",  
    "В) согнал", 
    "Г) отогнал"  
  ]
},
  { 
  numb: 28,
  question: "В китайском ресторане мы ... утку по-пекински. ",  
  answer: "Б) заказали",
  options: [ 
    "А) сказали", 
    "Б) заказали",
    "В) отказали", 
    "Г) приказали"   
  ]
},
{
  numb: 29,
  question: "Мария ... сына домой из детского сада в 16 часов.",  
  answer: "Б) приводит", 
  options: [
    "А) переводит",
    "Б) приводит",  
    "В) наводит",
    "Г) заводит"   
  ]
},
{
  numb: 30,
  question: "Сергей ... к дому веранду.",  
  answer: "В) пристроил",
  options: [
    "А) выстроил", 
    "Б) построил", 
    "В) пристроил",
    "Г) застроил"  
  ]
},

];