// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "В городе открылся новый ... завод.",
    answer: "Б) стекольный",
    options: [
      "А) стеклянный",
      "Б) стекольный",
      "В) стекловидный",
      "",
    ]
  },
    { 
    numb: 2,
    question: "На ёлке висели красивые ... шары.",
    answer: "Б) стеклянные",
    options: [ 
      "А) стекольные", 
      "Б) стеклянные", 
      "В) стекловидные", 
      ""  
    ]
  },
    {
    numb: 3, 
    question: "Космический корабль облетел вокруг ... шара.",
    answer: "А) земного",
    options: [
      "А) земного", 
      "Б) земляного",
      "В) земельного",
      ""  
    ]
  },
    {
    numb: 4,
    question: "... вал защищает крепость.", 
    answer: "В) Земляной",  
    options: [
      "А) Земельный", 
      "Б) Землистый", 
      "В) Земляной", 
      ""  
    ]
  },
    {
    numb: 5,
    question: "Мы купили ... участок.", 
    answer: "Б) земельный",
    options: [ 
      "А) земляной", 
      "Б) земельный",
      "В) землистый",  
      "" 
    ]
  },
  {
    numb: 6,
    question: "Он учится в академии ... транспорта.", 
    answer: "А) водного", 
    options: [
      "А) водного",
      "Б) водяного", 
      "В) водянистого",
      "" 
    ]  
  },
  {
    numb: 7,
    question: "Бумажные деньги защищены ... знаками.", 
    answer: "В) водяными", 
    options: [
      "А) водными",
      "Б) водянистыми",  
      "В) водяными",
      ""  
    ]
  },
  {
    numb: 8,
    question: "Меня удивила ... природа этого края.",
    answer: "В) бедная", 
    options: [
      "А) бедовая", 
      "Б) бедственная", 
      "В) бедная",
      ""   
    ]
  },
  {
    numb: 9,
    question: "Семья оказалась в ... положении.", 
    answer: "Б) бедственном",  
    options: [
      "А) бедном", 
      "Б) бедственном",  
      "В) бедовом", 
      ""   
    ]
  },
  {
    numb: 10,
    question: "Мне нравится это ароматное ..., мыло.", 
    answer: "А) душистое",
    options: [
      "А) душистое",  
      "Б) душевное", 
      "В) душевое", 
      "" 
    ]
  },
  {
    numb: 11,
    question: "Я была благодарна Ольге за ... беседу.", 
    answer: "А) душевную", 
    options: [ 
      "А) душевную", 
      "Б) душевую",
      "В) душную", 
      ""   
    ]
  },
  {
    numb: 12,
    question: "Моя ... куртка уже вышла из моды.", 
    answer: "В) кожаная",  
    options: [
      "А) кожевенная", 
      "Б) кожная", 
      "В) кожаная", 
      ""  
    ]
  },
  {
    numb: 13,
    question: "В Ботаническом саду мы видели растения с ... листьями.", 
    answer: "Б) кожистыми",  
    options: [
      "А) кожными", 
      "Б) кожистыми",  
      "В) кожаными ", 
      ""  
    ]
  },
  {
    numb: 14,
    question: "Белое вино нужно ...", 
    answer: "А) охладить", 
    options: [
      "А) охладить",  
      "Б) охладеть",  
      "В) холодить", 
      ""    
    ]
  }, 
  {
    numb: 15,
    question: "Браслет приятно ... кожу.", 
    answer: "Б) холодил",  
    options: [
      "А) охладил",  
      "Б) холодил",  
      "В) охладел", 
      ""    
    ]
  },
  {
    numb: 16,
    question: "Виктор ... к футболу.", 
    answer: "А) охладел",
    options: [
      "А) охладел", 
      "Б) холодел",  
      "В) охладил ",  
      ""  
    ]
  },
  {
    numb: 17,
    question: "При оформлении визы нужно заплатить ... сбор.", 
    answer: "А) консульский",  
    options: [
      "А) консульский",  
      "Б) консультативный ",  
      "В) консультационный",  
      ""   
    ]
  },
  {
    numb: 18,
    question: "Мы обратились за помощью в ... бюро.", 
    answer: "Б) консультационное", 
    options: [ 
      "А) консультативное",  
      "Б) консультационное",
      "В) консульское",  
      ""    
    ]
  },
  {
    numb: 19,
    question: "Для опытов используется ... кислота.",  
    answer: "Б) концентрированная",   
    options: [
      "А) концентрическая",  
      "Б) концентрированная",  
      "В) концентрационная",  
      ""   
    ]
  },
  {
    numb: 20, 
    question: "Во время войны на этом месте был ... лагерь.",  
    answer: "А) концентрационный",   
    options: [
      "А) концентрационный", 
      "Б) концентрический",   
      "В) концентрированный",  
      ""   
    ]
  },
  {
    numb: 21,
    question: "У этого растения развитая ... система.",  
    answer: "Б) корневая",  
    options: [
      "А) коренная",   
      "Б) корневая",  
      "В) корешковая",  
      ""    
    ]
  }, 
  {
    numb: 22,
    question: "Отец моего друга ... москвич.",  
    answer: "Б) коренной",   
    options: [
      "А) корневой",   
      "Б) коренной",   
      "В) коренастый",  
      ""     
    ]
  },
  {
    numb: 23,
    question: "Эта рыба очень ...",  
    answer: "А) костистая", 
    options: [
      "А) костистая",  
      "Б) костная", 
      "В) костяная",  
      ""   
    ]
  },
  {
    numb: 24,
    question: "Мне подарили красивую ... шкатулку.", 
    answer: "Б) костяную",  
    options: [
      "А) костную", 
      "Б) костяную", 
      "В) костистую", 
      "", 
    ]
  },
    { 
    numb: 25,
    question: "Больному сделали операцию по пересадке ... мозга.", 
    answer: "В) костного",
    options: [ 
      "А) костяного",  
      "Б) костистого", 
      "В) костного", 
      ""  
    ]
  },
    {
    numb: 26, 
    question: "С моря дул ... ветер.", 
    answer: "А) ледяной",  
    options: [
      "А) ледяной", 
      "Б) ледовый ",
      "В) ледниковый", 
      ""  
    ]
  },
    {
    numb: 27, 
    question: "Мы с удовольствием смотрели ... представление.",  
    answer: "Б) ледовое", 
    options: [
      "А) ледниковое",  
      "Б) ледовое",  
      "В) ледяной",  
      ""  
    ]
  },
    { 
    numb: 28,
    question: "В современных холодильниках большие ... камеры.",  
    answer: "Б) морозильные", 
    options: [ 
      "А) морозные", 
      "Б) морозильные",
      "В) замороженные", 
      ""   
    ]
  },
  {
    numb: 29,
    question: "В этом магазине продают только ... рыбу.",  
    answer: "А) мороженую",  
    options: [
      "А) мороженую",
      "Б) морозную",  
      "В) морозильную",
      ""  
    ]
  },
  {
    numb: 30,
    question: "В прошлом году зима была очень ...",  
    answer: "Б) морозная",
    options: [
      "А) мороженная", 
      "Б) морозная", 
      "В) морозильная",
      ""   
    ]
  },
  {
    numb: 31,
    question: "Спектакль имел ... успех.", 
    answer: "А) невиданный",  
    options: [
      "А) невиданный", 
      "Б) невидимый",  
      "В) невидящий", 
      ""   
    ]
  },
  {
    numb: 32,
    question: "Меня испугал его ... взгляд.",  
    answer: "В) невидящий",  
    options: [
      "А) невидимый", 
      "Б) невиданный",  
      "В) невидящий",   
      ""  
    ]
  },
  {
    numb: 33,
    question: "Анна сделала брату ... замечание.", 
    answer: "Б) обидное",  
    options: [
      "А) обидчивое",  
      "Б) обидное",  
      "В) обиженное",  
      ""   
    ]
  },
  {
    numb: 34,
    question: "Она сидела с ... видом.",  
    answer: "Б) обиженным", 
    options: [ 
      "А) обидным",  
      "Б) обиженным",
      "В) обидчивым", 
      ""    
    ]
  },
  {
    numb: 35,
    question: "Наш университет предлагает различные ... программы.",  
    answer: "Б) образовательные",  
    options: [
      "А) образованные", 
      "Б) образовательные",  
      "В) образцовые",  
      ""   
    ]
  },
  {
    numb: 36,
    question: "... работа занимает всё его свобод ное время.", 
    answer: "Б) Общественная", 
    options: [
      "А) Общая",  
      "Б) Общественная",  
      "В) Общительная", 
      "" 
    ]
  },
  {
    numb: 37,
    question: "В лесу раздавались ... выстрелы.", 
    answer: "Б) одиночные",
    options: [ 
      "А) одинокие ",  
      "Б) одиночные",  
      "В) одинаковые", 
      ""    
    ] 
  }, 
  {
    numb: 38,
    question: "Он чувствовал себя ... в незнакомом городе.",  
    answer: "Б) одиноким",  
    options: [
      "А) одиночным",  
      "Б) одиноким",  
      "В) одинаковым", 
      ""     
    ]
  },
  {
    numb: 39,
    question: "Какие ... языки вы знаете?", 
    answer: "Б) родственные", 
    options: [
      "А) родные", 
      "Б) родственные", 
      "В) родовые",  
      ""  
    ]
  },
  {
    numb: 40,
    question: "Её сын проявлял ... отношение ко взрослым.", 
    answer: "А) уважительное", 
    options: [
      "А) уважительное",  
      "Б) уважаемое",  
      "В) важное",  
      ""  
    ]
  },

];