// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Я люблю ... программу «Новости».",
  answer: "Б) смотреть", 
  options: [
    "А) смотрю",
    "Б) смотреть",
    "В) буду смотреть",
    ""
  ]
},
  { 
  numb: 2,
  question: "Марта часто ... письма из дома.",
  answer: "В) получает", 
  options: [ 
    "А) получать", 
    "Б) получит ",
    "В) получает",
    ""
  ]
},
  {
  numb: 3, 
  question: "Завтра мы ... Домашнее задание.", 
  answer: "Б) будем делать", 
  options: [
    "А) делать",
    "Б) будем делать",
    "В) делаем",
    ""
  ]
},
  {
  numb: 4,
  question: "Я хочу ... маме цветы.", 
  answer: "В) подарить",  
  options: [
    "А) дарит", 
    "Б) дарил",
    "В) подарить",
    ""
  ]
},
  {
  numb: 5,
  question: "Почему ты ... вчера на урок?",  
  answer: "А) опоздал", 
  options: [ 
    "А) опоздал", 
    "Б) опоздаешь",
    "В) опаздывал",
    ""
  ]
},
{
  numb: 6,
  question: "Сергей долго ... фотоаппарат в магазине.", 
  answer:  "В) выбирал",  
  options: [
    "А) выбрал", 
    "Б) выбирать",
    "В) выбирал",
    ""
  ]
},
{
  numb: 7,
  question: "Антон не смог... трудную задачу.",  
  answer: "Б) решить", 
  options: [
    "А) решать", 
    "",
    "Б) решить",
    ""
  ]
},
{
  numb: 8,
  question: "Антону надо ... З задачи.", 
  answer: "Б) решить",
  options: [
    "А) решать", 
    "",
    "Б) решить",
    ""
  ]
},
{
  numb: 9,
  question: "Ты уже начал ... последнюю задачу?", 
  answer: "А) решать",  
  options: [
    "А) решать", 
    "",
    "Б) решить",
    "" 
  ]
},
{
  numb: 10,
  question: "Мы будем ... задачи весь урок.", 
  answer: "А) решать",
  options: [
    "А) решать", 
    "",
    "Б) решить",
    "" 
  ]
},
{
  numb: 11,
  question: "Анна вчера долго ... рассказ.", 
  answer: "А) писала", 
  options: [ 
    "А) писала", 
    "",
    "Б) написала",
    "" 
  ]
},
{
  numb: 12,
  question: "В воскресенье Мария ... 5 писем. ",  
  answer: "Б) написала",  
  options: [
    "А) писала", 
    "",
    "Б) написала",
    "" 
  ]
},
{
  numb: 13,
  question: "Ты уже ... всё упражнение?", 
  answer: "Б) написала",  
  options: [
    "А) писала", 
    "",
    "Б) написала",
    "" 
  ]
},
{
  numb: 14,
  question: "Ира ... новые слова 30 минут.", 
  answer: "А) писала",
  options: [
    "А) писала", 
    "",
    "Б) написала",
    "" 
  ] 
}, 
{
  numb: 15,
  question: "Я часто ... этого студента в библиотеке.", 
  answer: "А) встречал", 
  options: [
    "А) встречал",  
    "",
    "Б) встретил",
    ""  
  ]
},
{
  numb: 16,
  question: "Сегодня я ... Жана на Невском проспекте. ", 
  answer: "Б) встретил",
  options: [
    "А) встречал",  
    "",
    "Б) встретил",
    ""  
  ]
},
{
  numb: 17,
  question: "Я никогда не ... этого человека раньше. ", 
  answer: "А) встречал", 
  options: [
    "А) встречал",  
    "",
    "Б) встретил",
    "" 
  ]
},
{
  numb: 18,
  question: "Как хорошо, что я тебя ...", 
  answer: "Б) встретил",
  options: [ 
    "А) встречал",  
    "",
    "Б) встретил",
    "" 
  ]
},
{
  numb: 19,
  question: "Моя мама любит ...",  
  answer: "В) готовить",  
  options: [
    "А) готовила", 
    "Б) приготовит",
    "В) готовить",
    "Г) приготовила"
  ]
},
{
  numb: 20, 
  question: "Ты уже ... ужин?",  
  answer: "Г) приготовила",  
  options: [
    "А) готовила", 
    "Б) приготовит",
    "В) готовить",
    "Г) приготовила"
  ]
},
{
  numb: 21,
  question: "Раньше она никогда не ...",  
  answer: "А) готовила", 
  options: [
    "А) готовила", 
    "Б) приготовит",
    "В) готовить",
    "Г) приготовила"  
  ]
}, 
{
  numb: 22,
  question: "Оля ... рыбу завтра.",  
  answer: "Б) приготовит",  
  options: [
    "А) готовила", 
    "Б) приготовит",
    "В) готовить",
    "Г) приготовила"
  ]
},
{
  numb: 23,
  question: "Лора ... стихи завтра.",  
  answer: "Г) выучит", 
  options: [
    "А) учит", 
    "Б) учить",
    "В) выучила",
    "Г) выучит"
  ]
},
{
  numb: 24,
  question: "Моя подруга уже ... вчера эту песню.", 
  answer: "В) выучила", 
  options: [
    "А) учит", 
    "Б) учить",
    "В) выучила",
    "Г) выучит"
  ]
},
  { 
  numb: 25,
  question: "Она всегда ... слова быстро.", 
  answer: "А) учит", 
  options: [ 
    "А) учит", 
    "Б) учить",
    "В) выучила",
    "Г) выучит"
  ]
},
  {
  numb: 26, 
  question: "Таня не будет ... текст.", 
  answer: "Б) учить", 
  options: [
    "А) учит", 
    "Б) учить",
    "В) выучила",
    "Г) выучит"
  ]
},
  {
  numb: 27, 
  question: "Я хочу ... подругу в кино.",  
  answer: "В) приглашать", 
  options: [
    "А) приглашает", 
    "Б) пригласить",
    "В) приглашать",
    "Г) пригласила" 
  ]
},
  { 
  numb: 28,
  question: "Лена любит ... гостей.",  
  answer: "Б) пригласить",
  options: [ 
    "А) приглашает", 
    "Б) пригласить",
    "В) приглашать",
    "Г) пригласила" 
  ]
},
{
  numb: 29,
  question: "Вчера Ольга ... меня в театр. ",  
  answer: "Г) пригласила", 
  options: [
    "А) приглашает", 
    "Б) пригласить",
    "В) приглашать",
    "Г) пригласила" 
  ]
},
{
  numb: 30,
  question: "Кто часто ... тебя на дискотеку?",  
  answer: "А) приглашает",
  options: [
    "А) приглашает", 
    "Б) пригласить",
    "В) приглашать",
    "Г) пригласила" 
  ]
},
{
  numb: 31,
  question: "Мигель уже хорошо ... по-русски. ", 
  answer: "Г) читает", 
  options: [
    "А) читать",  
    "Б) прочитает",
    "В) прочитал",
    "Г) читает"
  ]
},
{
  numb: 32,
  question: "Ты уже ... эту книгу?",  
  answer: "В) прочитал",  
  options: [
    "А) читать",  
    "Б) прочитает",
    "В) прочитал",
    "Г) читает"
  ]
},
{
  numb: 33,
  question: "Завтра Джон ... этот журнал.", 
  answer: "Б) прочитает", 
  options: [
    "А) читать",  
    "Б) прочитает",
    "В) прочитал",
    "Г) читает"
  ]
},
{
  numb: 34,
  question: "Ему нравится ... детективы.",  
  answer: "А) читать",
  options: [ 
    "А) читать",  
    "Б) прочитает",
    "В) прочитал",
    "Г) читает"
  ]
},
{
  numb: 35,
  question: "Джулия часто ... домой.",  
  answer: "Б) звонит", 
  options: [
    "А) позвонит",  
    "Б) звонит",
    "В) позвонить",
    "Г) позвонила" 
  ]
},
{
  numb: 36,
  question: "Мне надо врачу ... ", 
  answer: "В) позвонить", 
  options: [
    "А) позвонит",  
    "Б) звонит",
    "В) позвонить",
    "Г) позвонила" 
  ]
},
{
  numb: 37,
  question: "Почему ты не ... мне вчера?", 
  answer: "Г) позвонила",
  options: [
    "А) позвонит",  
    "Б) звонит",
    "В) позвонить",
    "Г) позвонила" 
  ]
}, 
{
  numb: 38,
  question: "Она обязательно ... тебе завтра.",  
  answer: "А) позвонит", 
  options: [ 
    "А) позвонит",  
    "Б) звонит",
    "В) позвонить",
    "Г) позвонила" 
  ]
},
{
  numb: 39,
  question: "Завтра Борис ... мне новые фотографии. ", 
  answer: "В) покажет",  
  options: [
    "А) показывает",   
    "Б) показывать",
    "В) покажет",
    "Г) показать"
  ]
},
{
  numb: 40,
  question: "Я хочу ... тебе мой университет.", 
  answer: "Г) показать", 
  options: [
    "А) показывает",   
    "Б) показывать",
    "В) покажет",
    "Г) показать"
  ]
},
{
  numb: 41,
  question: "Андрей часто ... мне интересные места города.",  
  answer: "А) показывает", 
  options: [
    "А) показывает",   
    "Б) показывать",
    "В) покажет",
    "Г) показать" 
  ]
}, 
{
  numb: 42,
  question: "Экскурсовод будет ... нам картины.",  
  answer: "Б) показывать",  
  options: [
    "А) показывает",   
    "Б) показывать",
    "В) покажет",
    "Г) показать"
  ]
},
{
  numb: 43,
  question: "Раньше я всегда ... газеты в этом киоске.",  
  answer: "Б) покупал",
  options: [
    "А) купил", 
    "Б) покупал",
    "В) купить",
    "Г) покупаю"
  ]
},
{
  numb: 44,
  question: "Сейчас я часто ... газеты в другом киоске.", 
  answer: "Г) покупаю", 
  options: [
    "А) купил", 
    "Б) покупал",
    "В) купить",
    "Г) покупаю"
  ]
},
  { 
  numb: 45,
  question: "Сегодня утром я ... 2 газеты. ", 
  answer: "А) купил", 
  options: [ 
    "А) купил", 
    "Б) покупал",
    "В) купить",
    "Г) покупаю"
  ]
},
  {
  numb: 46, 
  question: "Сергей хочет ... билеты на футбол", 
  answer: "В) купить", 
  options: [
    "А) купил", 
    "Б) покупал",
    "В) купить",
    "Г) покупаю"
  ]
},
  {
  numb: 47, 
  question: "Мой друг уже закончил ... грамматику.",  
  answer: "А) повторять",  
  options: [
    "А) повторять",
    "Б) повторяю",
    "В) повторю",
    "Г) повторил"
  ]
},
  { 
  numb: 48,
  question: "Я завтра ... новые правила.",  
  answer: "В) повторю",
  options: [ 
    "А) повторять",
    "Б) повторяю",
    "В) повторю",
    "Г) повторил"
  ]
},
{
  numb: 49,
  question: "Я ... стихи каждый день.",  
  answer: "Б) повторяю", 
  options: [
    "А) повторять",
    "Б) повторяю",
    "В) повторю",
    "Г) повторил"
  ]
},
{
  numb: 50,
  question: "Иван уже ... слова песни.",  
  answer: "Г) повторил",
  options: [
    "А) повторять",
    "Б) повторяю",
    "В) повторю",
    "Г) повторил"
  ]
},
{
  numb: 51,
  question: "Фред любит ... о своей стране.",  
  answer: "А) рассказывать", 
  options: [
    "А) рассказывать", 
    "Б) рассказывает",
    "В) рассказал",
    "Г) расскажет" 
  ]
}, 
{
  numb: 52,
  question: "Он потом ... мне об экскурсии.",  
  answer: "Г) расскажет",  
  options: [
    "А) рассказывать", 
    "Б) рассказывает",
    "В) рассказал",
    "Г) расскажет"
  ]
},
{
  numb: 53,
  question: "Он уже ... текст вчера.",  
  answer: "В) рассказал",
  options: [
    "А) рассказывать", 
    "Б) рассказывает",
    "В) рассказал",
    "Г) расскажет"
  ]
},
{
  numb: 54,
  question: "Рами часто ... интересные истории. ", 
  answer: "Б) рассказывает", 
  options: [
    "А) рассказывать", 
    "Б) рассказывает",
    "В) рассказал",
    "Г) расскажет"
  ]
},
  { 
  numb: 55,
  question: "Кто может ... мне эту задачу?", 
  answer: "Б) объяснить", 
  options: [ 
    "А) объяснял",
    "Б) объяснить", 
    "В) объяснил",
    "Г) объяснит"
  ]
},
  {
  numb: 56, 
  question: "Преподаватель весь урок ... новую тему. ", 
  answer: "А) объяснял", 
  options: [
    "А) объяснял",
    "Б) объяснить", 
    "В) объяснил",
    "Г) объяснит"
  ]
},
  {
  numb: 57, 
  question: "Он быстро... мне, где находится почта.",  
  answer: "В) объяснил",  
  options: [
    "А) объяснял",
    "Б) объяснить", 
    "В) объяснил",
    "Г) объяснит"
  ]
},
  { 
  numb: 58,
  question: "Завтра Хорхе  ... мне трудное правило.",  
  answer: "Г) объяснит",
  options: [ 
    "А) объяснял",
    "Б) объяснить", 
    "В) объяснил",
    "Г) объяснит"
  ]
},
{
  numb: 59,
  question: "Куда ... сейчас Ольга?",  
  answer: "А) идёт", 
  options: [
    "А) идёт",
    "",
    "Б) ходит",
    ""
  ]
},
{
  numb: 60,
  question: "Каждый день она ... в библиотеку.",  
  answer: "Б) ходит",
  options: [
    "А) идёт",
    "",
    "Б) ходит",
    ""
  ]
},
{
  numb: 61,
  question: "Кто ... сегодня на экскурсию? ", 
  answer: "А) идёт", 
  options: [
    "А) идёт",
    "",
    "Б) ходит",
    ""
  ]
},
{
  numb: 62,
  question: "Он часто ... в театр?",  
  answer: "Б) ходит",  
  options: [
    "А) идёт",
    "",
    "Б) ходит",
    ""
  ]
},
{
  numb: 63,
  question: "Вчера я ... в музей.", 
  answer: "Б) ходил", 
  options: [
    "А) идёшь", 
    "Б) ходил", 
    "В) пойдёшь",
    ""
  ]
},
{
  numb: 64,
  question: "Куда ты ... сейчас?",  
  answer: "А) идёшь",
  options: [ 
    "А) идёшь", 
    "Б) ходил", 
    "В) пойдёшь",
    ""
  ]
},
{
  numb: 65,
  question: "Ты уже... в столовую?",  
  answer: "Б) ходил", 
  options: [
    "А) идёшь", 
    "Б) ходил", 
    "В) пойдёшь",
    ""
  ]
},
{
  numb: 66,
  question: "Ты ... завтра на стадион?", 
  answer: "В) пойдёшь", 
  options: [
    "А) идёшь", 
    "Б) ходил", 
    "В) пойдёшь",
    ""
  ]
},
{
  numb: 67,
  question: "Ира часто ... в Москву.", 
  answer: "Б) ездит",
  options: [
    "А) едет",  
    "",
    "Б) ездит",
    ""
  ]
}, 
{
  numb: 68,
  question: "Сейчас она ... в центр. ",  
  answer: "А) едет", 
  options: [
    "А) едет",  
    "",
    "Б) ездит",
    ""
  ]
},
{
  numb: 69,
  question: "Куда она ... каждый день?", 
  answer: "Б) ездит", 
  options: [
    "А) едет",  
    "",
    "Б) ездит",
    ""
  ]
},
{
  numb: 70,
  question: "Сейчас мама ... на работу.", 
  answer: "А) едет", 
  options: [
    "А) едет",  
    "",
    "Б) ездит",
    ""
  ]
},

];