// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "Я заходил вчера к Игорю, но не ... его дома.",
    answer: "Б) застал", 
    options: [
      "А) настал",
      "Б) застал",
      "В) достал",
      "Г) отстал",
    ]
  },
    { 
    numb: 2,
    question: "Это объявление в газете ... моё внимание.",
    answer: "В) привлекло", 
    options: [ 
      "А) увлекло", 
      "Б) завлекло", 
      "В) привлекло", 
      "Г) навлекло"  
    ]
  },
    {
    numb: 3, 
    question: "Я давно не видела Олега. Не знаешь, куда он ... ?",
    answer: "Г) пропал", 
    options: [
      "А) выпал", 
      "Б) отпал",
      "В) напал",
      "Г) пропал"   
    ]
  },
    {
    numb: 4,
    question: "Он ... собаку с поводка.", 
    answer: "А) отпустил",   
    options: [
      "А) отпустил", 
      "Б) впустил", 
      "В) пропустил", 
      "Г) запустил"  
    ]
  },
    {
    numb: 5,
    question: "Она гладила блузку очень горячим утюгом и ... её.", 
    answer: "В) прожгла", 
    options: [ 
      "А) пережгла", 
      "Б) выжгла",
      "В) прожгла",  
      "Г) зажгла" 
    ]
  },
  {
    numb: 6,
    question: "Сын хотел ... правду от родителей.", 
    answer: "А) скрыть",  
    options: [
      "А) скрыть",
      "Б) укрыть", 
      "В) прикрыть",
      "Г) закрыть" 
    ]  
  },
  {
    numb: 7,
    question: "В машине кончается бензин, надо ...", 
    answer: "Г) заправиться",  
    options: [
      "А) справиться",
      "Б) отправиться",  
      "В) переправиться",
      "Г) заправиться"  
    ]
  },
  {
    numb: 8,
    question: "Суд ... обвиняемого к трём годам лишения свободы.",
    answer: "Б) приговорил",  
    options: [
      "А) наговорил ", 
      "Б) приговорил", 
      "В) переговорил",
      "Г) договорил"   
    ]
  },
  {
    numb: 9,
    question: "Пол в квартире … до блеска.", 
    answer: "В) натёрли",   
    options: [
      "А) вытерли", 
      "Б) затёрли",  
      "В) натёрли", 
      "Г) стёрли"   
    ]
  },
  {
    numb: 10,
    question: "Ткань ... на солнце и потеряла яркость.", 
    answer: "А) выцвела", 
    options: [
      "А) выцвела",  
      "Б) расцвела", 
      "В) зацвела", 
      "Г) отцвела" 
    ]
  },
  {
    numb: 11,
    question: "Милиция ... хулиганство подростков.", 
    answer: "Б) пресекла",  
    options: [ 
      "А) засекла", 
      "Б) пресекла",
      "В) отсекла", 
      "Г) высекла"   
    ]
  },
  {
    numb: 12,
    question: "Она ... волосы назад и завязала их.", 
    answer: "В) зачесала",   
    options: [
      "А) вычесала", 
      "Б) причесала", 
      "В) зачесала", 
      "Г) начесала"  
    ]
  },
  {
    numb: 13,
    question: "Виктор совсем ... занятия спортом.", 
    answer: "Г) забросил",   
    options: [
      "А) сбросил", 
      "Б) набросил",  
      "В) выбросил", 
      "Г) забросил"  
    ]
  },
  {
    numb: 14,
    question: "Мы ... опавшие листья в кучи и жгли их.", 
    answer: "Б) сгребали",  
    options: [
      "А) подгребали",  
      "Б) сгребали",  
      "В) загребали", 
      "Г) отгребали"    
    ]
  }, 
  {
    numb: 15,
    question: "Это блюдо … в ресторане с острым соусом.", 
    answer: "А) подают",  
    options: [
      "А) подают",  
      "Б) отдают",  
      "В) выдают", 
      "Г) раздают"    
    ]
  },
  {
    numb: 16,
    question: "Террористы … заложников в здании школы.", 
    answer: "Б) удерживали",
    options: [
      "А) задерживали", 
      "Б) удерживали",  
      "В) выдерживали",  
      "Г) сдерживали"   
    ]
  },
  {
    numb: 17,
    question: "Моя сестра … сад фруктовыми деревьями.", 
    answer: "Г) засадила",   
    options: [
      "А) посадила",  
      "Б) отсадила",  
      "В) пересадила",  
      "Г) засадила"   
    ]
  },
  {
    numb: 18,
    question: "По этому вопросу я ... другого мнения.", 
    answer: "А) придерживаюсь",  
    options: [ 
      "А) придерживаюсь",  
      "Б) удерживаюсь",
      "В) сдерживаюсь",  
      "Г) задерживаюсь"    
    ]
  },
  {
    numb: 19,
    question: "Туристы ... от маршрута.",  
    answer: "В) отклонились",    
    options: [
      "А) наклонились",  
      "Б) уклонились",  
      "В) отклонились",  
      "Г) склонились"   
    ]
  },
  {
    numb: 20, 
    question: "Ситуация изменилась, тебе стоит ... своё мнение.",  
    answer: "А) пересмотреть",    
    options: [
      "А) пересмотреть", 
      "Б) рассмотреть",   
      "В) досмотреть",  
      "Г) просмотреть"   
    ]
  },
  {
    numb: 21,
    question: "Я не знаю, какой метод нужно … при решении этой задачи.",  
    answer: "Г) применить",  
    options: [
      "А) заменить",   
      "Б) сменить",  
      "В) изменить",  
      "Г) применить"    
    ]
  }, 
  {
    numb: 22,
    question: "Кошка прыгнула на машину, сразу ... сигнализация.",  
    answer: "В) сработала",    
    options: [
      "А) проработала",   
      "Б) обработала",   
      "В) сработала",  
      "Г) отработала"     
    ]
  },
  {
    numb: 23,
    question: "Родители ... ребёнка спать в 9 часов вечера.",  
    answer: "А) укладывают",  
    options: [
      "А) укладывают",  
      "Б) прикладывают", 
      "В) откладывают ",   
      "Г) перекладывают"   
    ]
  },
  {
    numb: 24,
    question: "Мой любимый спортсмен … первый гол в этом матче.", 
    answer: "А) забил",  
    options: [ 
      "А) забил", 
      "Б) сбил", 
      "В) выбил", 
      "Г) отбил", 
    ]
  },
    { 
    numb: 25,
    question: "Нужно ... проезд в автобусе.", 
    answer: "Б) оплатить", 
    options: [ 
      "А) заплатить",  
      "Б) оплатить", 
      "В) выплатить", 
      "Г) переплатить"  
    ]
  },
    {
    numb: 26, 
    question: "Ты уже ... пуговицу на пальто?", 
    answer: "А) пришила",   
    options: [
      "А) пришила", 
      "Б) зашила",
      "В) подшила ", 
      "Г) дошила"  
    ]
  },
    {
    numb: 27, 
    question: "Мы уже … маршрут нашего путешествия.",  
    answer: "В) наметили",  
    options: [
      "А) приметили",  
      "Б) заметили",  
      "В) наметили",  
      "Г) отметили"  
    ]
  },
    { 
    numb: 28,
    question: "Саша сначала нарисовал рисунок карандашом, а потом ... красками.",  
    answer: "Г) раскрасил",  
    options: [ 
      "А) перекрасил", 
      "Б) закрасил",
      "В) украсил", 
      "Г) раскрасил"   
    ]
  },
  {
    numb: 29,
    question: "В ягодах много мусора, надо их ...",  
    answer: "А) перебрать",   
    options: [
      "А) перебрать",
      "Б) собрать",  
      "В) выбрать",
      "Г) убрать"  
    ]
  },
  {
    numb: 30,
    question: "..., пожалуйста, гвоздь в эту стену.",  
    answer: "В) Забей", 
    options: [
      "А) Набей", 
      "Б) Выбей", 
      "В) Забей",
      "Г) Отбей"   
    ]
  },

];