// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "Она не знала, что делать: ... вызывать врача, ... самой пойти в поликлинику.",
    answer: "Г) то ли ... то ли ...",
    options: [
      "А) и ... и ...",
      "Б) ни ... ни ...", 
      "В) то ... то ...",
      "Г) то ли ... то ли ...", 
    ]
  },
    { 
    numb: 2,
    question: "У неё настроение меняется каждую минуту: ... она смеётся,.... хмурится.",
    answer: "В) то ... то ...",
    options: [ 
      "А) ни ... ни ... ", 
      "Б) то ли ... то ли ...", 
      "В) то ... то ...",  
      "Г) да ... да ..."  
    ]
  },
    {
    numb: 3, 
    question: "Братья часто ссорятся: ... один не уступает, ... другой.",
    answer: "Б) ни ... ни ...", 
    options: [
      "А) или ... или ...", 
      "Б) ни ... ни ...",
      "В) не то ... не то ...",
      "Г) да ... да ..."   
    ]
  },
    {
    numb: 4,
    question: "Сестра делает домашнее задание очень невнимательно: … телевизор смотрит, ... болтает по телефону.", 
    answer: "Б) то ... то ...",  
    options: [
      "А) ни ... ни ...", 
      "Б) то ... то ...", 
      "В) не то ... не то ... ", 
      "Г) то ли ... то ли ..."   
    ]
  },
    {
    numb: 5,
    question: "Не знаю, что делать: ... ехать в Москву, ... не ехать.", 
    answer: "Г) то ли ... то ли ...", 
    options: [ 
      "А) и... и ...", 
      "Б) ни ... ни ...",
      "В) то ... то ...",  
      "Г) то ли ... то ли ..."  
    ]
  },
  {
    numb: 6,
    question: "Выбери какое-нибудь одно платье: тебе идёт ... голубое, ... красное.", 
    answer: "Б) и ... и ...",  
    options: [
      "А) да ... да ...",
      "Б) и ... и ...", 
      "В) ни ... ни ...",
      "Г) то ... то ..."  
    ]  
  },
  {
    numb: 7,
    question: "Анна не может жить без развлечений: … она идёт на танцы, … мчится на концерт.", 
    answer: "Г) то ... то ...",  
    options: [
      "А) ни ... ни ...",
      "Б) не то ... не то ...",  
      "В) и ... и ...",
      "Г) то ... то ..."  
    ] 
  },
  {
    numb: 8,
    question: "Я не мог понять: ... она шутит, … говорит серьёзно. ",
    answer: "В) то ли ... то ли ...",  
    options: [
      "А) то ... то ... ", 
      "Б) ни ... ни ...",  
      "В) то ли ... то ли ...",
      "Г) да ... да ..."   
    ]
  },
  {
    numb: 9,
    question: "Давай решим: ... Мы едем на юг вместе, ... я еду одна.", 
    answer: "А) или ... или ...",   
    options: [
      "А) или ... или ...", 
      "Б) то ... то ... ",   
      "В) не то ... не то ...", 
      "Г) и ... и ..."   
    ]
  },
  {
    numb: 10,
    question: "Я довольна своим сыном: он ... учится хорошо, … успевает заниматься спортом.", 
    answer: "Г) и ... и ...", 
    options: [
      "А) или ... или ...",  
      "Б) ни ... ни ...", 
      "В) то ... то ...", 
      "Г) и ... и ..."  
    ]
  },
  {
    numb: 11,
    question: "Поездка в Милан была прекрасной: … город осмотрели, … оперу послушали.", 
    answer: "А) и ... и ...",  
    options: [ 
      "А) и ... и ...", 
      "Б) то ... то ...",
      "В) или ... или ...",  
      "Г) ни ... ни ..."   
    ]
  },
  {
    numb: 12,
    question: "Мы так и не помирились: … она не уступила мне, ... я ей.", 
    answer: "В) ни ... ни ...",   
    options: [
      "А) или ... или ...", 
      "Б) да … да …", 
      "В) ни ... ни ...", 
      "Г) не то ... не то ..."   
    ]
  },
  {
    numb: 13,
    question: "Я не могу решить, когда поехать в Петергоф: ... сегодня, … завтра.", 
    answer: "А) то ли ... то ли ...",   
    options: [
      "А) то ли ... то ли ...", 
      "Б) ни ... ни ...",  
      "В) да ... да ...", 
      "Г) и ... и ..."  
    ]
  },
  {
    numb: 14,
    question: "Давай решим: … ты позвонишь Андрею, … Я напишу ему.", 
    answer: "Б) или ... или ...",  
    options: [
      "А) то ... то ...",  
      "Б) или ... или ...",  
      "В) и ... и ...", 
      "Г) ни ... ни ..."     
    ]
  }, 
  {
    numb: 15,
    question: "Я не знаю, откуда эта студентка: ... из Испании, ... из Италии.", 
    answer: "Б) то ли ... то ли ...",   
    options: [
      "А) и... и ...",  
      "Б) то ли ... то ли ...",  
      "В) ни ... ни ...",  
      "Г) то ... то ..."    
    ]
  },
  {
    numb: 16,
    question: "Я люблю, ... в вазе стояли живые цветы.", 
    answer: "В) чтобы", 
    options: [
      "А) что", 
      "Б) так как",  
      "В) чтобы",   
      "Г) когда"  
    ]
  },
  {
    numb: 17,
    question: "Вчера я попала под проливной дождь. Боюсь, ... заболеть.", 
    answer: "А) как бы не",   
    options: [
      "А) как бы не",  
      "Б) если бы не",  
      "В) когда бы не",   
      "Г) хотя бы не"   
    ]
  },
  {
    numb: 18,
    question: "Стоило ей начать петь, ... все замолчали.", 
    answer: "В) как",  
    options: [ 
      "А) после того как ",   
      "Б) прежде чем",
      "В) как",   
      "Г) когда"    
    ]
  },
  {
    numb: 19,
    question: "Я не помню,  ... она когда-нибудь обидела меня.",  
    answer: "Г) чтобы",    
    options: [
      "А) как",  
      "Б) словно",  
      "В) так как",   
      "Г) чтобы"   
    ]
  },
  {
    numb: 20, 
    question: "... Наташа пила кофе, Ольга говорила по телефону.",  
    answer: "А) Пока",    
    options: [
      "А) Пока", 
      "Б) Как только",   
      "В) Прежде чем",  
      "Г) Как"    
    ]
  },
  {
    numb: 21,
    question: "Я вижу, ... моя сестра повзрослела.",  
    answer: "В) как",   
    options: [
      "А) когда",   
      "Б) пока",  
      "В) как",   
      "Г) если"    
    ]
  }, 
  {
    numb: 22,
    question: "Я не знаю,  ... можно подойти с этим вопросом.",  
    answer: "В) к кому",    
    options: [
      "А) с кем",   
      "Б) у кого",   
      "В) к кому",   
      "Г) о ком"     
    ]
  },
  {
    numb: 23,
    question: "Таня хотела накрыть на стол,  ... пришли гости.",  
    answer: "Г) пока не",  
    options: [
      "А) пока",  
      "Б) когда", 
      "В) как только",   
      "Г) пока не"   
    ]
  },
  {
    numb: 24,
    question: "... мама готовила обед, сын играл на компьютере.", 
    answer: "В) Пока",   
    options: [
      "А) Как только", 
      "Б) Как", 
      "В) Пока",  
      "Г) После того как", 
    ]
  },
    { 
    numb: 25,
    question: "Не успела я подумать о сестре,  ... она мне позвонила. ", 
    answer: "Г) как", 
    options: [ 
      "А) пока",  
      "Б) когда", 
      "В) как только", 
      "Г) как"   
    ]
  },
    {
    numb: 26, 
    question: "Она говорила так тихо, ... я ничего не могла разобрать.", 
    answer: "А) что",   
    options: [
      "А) что", 
      "Б) как",
      "В) будто", 
      "Г) хотя"  
    ]
  },
    {
    numb: 27, 
    question: "Преподаватель говорил медленно,  ... студенты успели записать вопросы.",  
    answer: "А) чтобы", 
    options: [
      "А) чтобы",  
      "Б) пока",  
      "В) как",  
      "Г) раз"   
    ]
  },
    { 
    numb: 28,
    question: "Я встаю утром, ... звонит будильник.",  
    answer: "В) как только",  
    options: [ 
      "А) в связи с тем что", 
      "Б) пока не",
      "В) как только",  
      "Г) пока"   
    ]
  },
  {
    numb: 29,
    question: "Она не легла спать, ... написала письмо сестре.",  
    answer: "Г) пока не",  
    options: [
      "А) если",
      "Б) пока",  
      "В) когда", 
      "Г) пока не"  
    ]
  },
  {
    numb: 30,
    question: "... ты заболел, надо вызвать врача.",  
    answer: "А) Раз",
    options: [
      "А) Раз", 
      "Б) Несмотря на то что",  
      "В) Хотя",
      "Г) Чтобы"   
    ]
  },

];