// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "Вы умеете читать ... ?",
  answer: "Б) по-русски", 
  options: [
    "А) русский язык",
    "Б) по-русски",
    "В) русский",
    ""
  ]
},
  { 
  numb: 2,
  question: "... ты был?",
  answer: "В) где", 
  options: [ 
    "А) откуда", 
    "Б) куда",
    "В) в праздник",
    "В) где"
  ]
},
  {
  numb: 3, 
  question: "Я часто смотрю передачи ... телевизору.", 
  answer: "В) по", 
  options: [
    "А) в",
    "Б) на",
    "В) по",
    ""
  ]
},
  {
  numb: 4,
  question: "Ты часто ходишь ... музеи? ", 
  answer: "Б) в",  
  options: [
    "А) на", 
    "",
    "Б) в",
    ""
  ]
},
  {
  numb: 5,
  question: "Мы купили конверты... почте.",  
  answer: "А) на", 
  options: [ 
    "А) на", 
    "",
    "Б) в",
    ""
  ]
},
{
  numb: 6,
  question: "Антон учится... первом курсе.", 
  answer:  "А) на",  
  options: [
    "А) на", 
    "",
    "Б) в",
    ""
  ]
},
{
  numb: 7,
  question: "Моя сестра учится... школе.",  
  answer: "Б) в", 
  options: [
    "А) на", 
    "",
    "Б) в",
    ""
  ]
},
{
  numb: 8,
  question: "Анна ... на подготовительном факультете три месяца.", 
  answer: "Б) учится",
  options: [
    "А) учит", 
    "Б) учится",
    "В) изучает",
    "" 
  ]
},
{
  numb: 9,
  question: "Мария ... физику и математику. ", 
  answer: "В) изучает",  
  options: [
    "А) учит", 
    "Б) учится",
    "В) изучает",
    "" 
  ]
},
{
  numb: 10,
  question: "Каждый вечер Жан ... новые слова.", 
  answer: "А) учит",
  options: [
    "А) учит", 
    "Б) учится",
    "В) изучает",
    "" 
  ]
},
{
  numb: 11,
  question: "Твой брат ... или работает?", 
  answer: "Б) учится", 
  options: [ 
    "А) учит", 
    "Б) учится",
    "В) изучает",
    "" 
  ]
},
{
  numb: 12,
  question: "Как... твою подругу?",  
  answer: "Б) зовут",  
  options: [
    "А) называется ", 
    "",
    "Б) зовут",
    "" 
  ]
},
{
  numb: 13,
  question: "Почему этот музей ... Эрмитаж?", 
  answer: "А) называется ",  
  options: [
    "А) называется ", 
    "",
    "Б) зовут",
    "" 
  ]
},
{
  numb: 14,
  question: "Как ... ваша улица?", 
  answer: "А) называется ",
  options: [
    "А) называется ", 
    "",
    "Б) зовут",
    "" 
  ] 
}, 
{
  numb: 15,
  question: "Вашего брата ... Олег?", 
  answer: "Б) зовут", 
  options: [
    "А) называется ", 
    "",
    "Б) зовут",
    "" 
  ]
},
{
  numb: 16,
  question: "Это здание очень ...", 
  answer: "Б) красивое",
  options: [
    "А) красивый", 
    "Б) красивое",
    "В) красивая",
    ""  
  ]
},
{
  numb: 17,
  question: "Около института находится старый ...", 
  answer: "А) парк", 
  options: [
    "А) парк",  
    "Б) озеро",
    "В) площадь",
    ""
  ]
},
{
  numb: 18,
  question: "Познакомься, пожалуйста, это мой ...", 
  answer: "Б) папа",
  options: [ 
    "А) родители",  
    "Б) папа",
    "В) мама",
    "" 
  ]
},
{
  numb: 19,
  question: "Моё ... висит в шкафу.",  
  answer: "А) пальто",  
  options: [
    "А) пальто",  
    "Б) костюм",
    "В) рубашка",
    ""
  ]
},
{
  numb: 20, 
  question: "Наша семья живёт в ... доме.",  
  answer: "В) новом",  
  options: [
    "А) новый", 
    "Б) новой",
    "В) новом",
    "" 
  ]
},
{
  numb: 21,
  question: "В классе студенты читали... статью. ",  
  answer: "Б) интересную", 
  options: [
    "А) интересная",   
    "Б) интересную",
    "В) интересной",
    ""    
  ]
}, 
{
  numb: 22,
  question: "Это здание очень ...",  
  answer: "В) высокое",  
  options: [
    "А) высокие", 
    "Б) высокий",
    "В) высокое",
    "Г) высокая"
  ]
},
{
  numb: 23,
  question: "В лесу ... деревья.",  
  answer: "А) высокие", 
  options: [
    "А) высокие", 
    "Б) высокий",
    "В) высокое",
    "Г) высокая"
  ]
},
{
  numb: 24,
  question: "Мой брат ...", 
  answer: "Б) высокий", 
  options: [
    "А) высокие", 
    "Б) высокий",
    "В) высокое",
    "Г) высокая"
  ]
},
  { 
  numb: 25,
  question: "Это моё... пальто.", 
  answer: "Б) любимое", 
  options: [ 
    "А) любимая", 
    "Б) любимое",
    "В) любимый",
    "Г) любимые"
  ]
},
  {
  numb: 26, 
  question: "Ко мне пришёл... брат.", 
  answer: "В) любимый", 
  options: [
    "А) любимая", 
    "Б) любимое",
    "В) любимый",
    "Г) любимые"
  ]
},
  {
  numb: 27, 
  question: "Сегодня идёт дождь. Это моя... погода.",  
  answer: "А) любимая", 
  options: [
    "А) любимая", 
    "Б) любимое",
    "В) любимый",
    "Г) любимые"
  ]
},
  { 
  numb: 28,
  question: "Сегодня ... нет свободного времени.",  
  answer: "Б) у меня",
  options: [ 
    "А) я", 
    "Б) у меня",
    "В) мне",
    ""
  ]
},
{
  numb: 29,
  question: "... ты учишься в одной группе?",  
  answer: "В) с кем", 
  options: [
    "А) кого",
    "Б) кому",
    "В) с кем",
    ""
  ]
},
{
  numb: 30,
  question: "Вчера я встретил ... друга.",  
  answer: "А) твоего",
  options: [
    "А) твоего", 
    "Б) твоему",
    "В) с твоим",
    "" 
  ]
},
{
  numb: 31,
  question: "Я видел ... девушку в театре.", 
  answer: "В) эту", 
  options: [
    "А) этой",
    "Б) с этой",
    "В) эту",
    ""  
  ]
},
{
  numb: 32,
  question: "Моя мама идёт из ...",  
  answer: "В) магазина",  
  options: [
    "А) магазин",
    "Б) магазину", 
    "В) магазина",
    ""
  ]
},
{
  numb: 33,
  question: "Посмотри, твои книги лежат на ... ", 
  answer: "Б) столе", 
  options: [
    "А) столом",  
    "Б) столе",
    "В) стол",
    ""
  ]
},
{
  numb: 34,
  question: "В четверг я говорил по телефону ...",  
  answer: "В) с Виктором",
  options: [ 
    "А) Виктор",  
    "Б) Виктора",
    "В) с Виктором",
    ""
  ]
},
{
  numb: 35,
  question: "Ольга пришла домой ...",  
  answer: "Б) с лекции", 
  options: [
    "А) лекцией", 
    "Б) с лекции",
    "В) лекция",
    ""
  ]
},
{
  numb: 36,
  question: "Летом мы отдыхали ...", 
  answer: "В) в деревне", 
  options: [
    "А) деревня",  
    "Б) деревню",
    "В) в деревне",
    ""
  ]
},
{
  numb: 37,
  question: "На уроке мы говорили ...", 
  answer: "Б) о Москве",
  options: [
    "А) Москва ",  
    "Б) о Москве",
    "В) Москву",
    ""
  ]
}, 
{
  numb: 38,
  question: "Я забыла свои тетради ...",  
  answer: "В) дома", 
  options: [ 
    "А) дом",  
    "Б) доме",
    "В) дома",
    "" 
  ]
},
{
  numb: 39,
  question: "Вы поедете на экскурсию ... ?", 
  answer: "Б) на автобусе",  
  options: [
    "А) автобус", 
    "Б) на автобусе",
    "В) на автобус",
    ""
  ]
},
{
  numb: 40,
  question: "Я ещё не знаю, что подарить ...", 
  answer: "А) Анне", 
  options: [
    "А) Анне",  
    "Б) Анну",
    "В) об Анне",
    ""
  ]
},
{
  numb: 41,
  question: "В нашем доме нет ...",  
  answer: "В) лифта", 
  options: [
    "А) лифту",   
    "Б) лифт",
    "В) лифта",
    ""   
  ]
}, 
{
  numb: 42,
  question: "Летом Игорь был ...",  
  answer: "В) в Москве",  
  options: [
    "А) Москва",   
    "Б) из Москвы",
    "В) в Москве",
    ""
  ]
},
{
  numb: 43,
  question: "Я должен позвонить ...",  
  answer: "Б) бабушке",
  options: [
    "А) бабушку",  
    "Б) бабушке",
    "В) о бабушке",
    ""
  ]
},
{
  numb: 44,
  question: "Скажите, пожалуйста, сколько стоит...?", 
  answer: "А) молоко", 
  options: [
    "А) молоко", 
    "Б) молока",
    "В) о молоке",
    ""
  ]
},
  { 
  numb: 45,
  question: "Моя подруга серьёзно занимается ...", 
  answer: "Б) физикой", 
  options: [ 
    "А) физике",  
    "Б) физикой",
    "В) физика",
    ""
  ]
},
  {
  numb: 46, 
  question: "Мой отец работает ...", 
  answer: "Б) биологом", 
  options: [
    "А) биолог ", 
    "Б) биологом",
    "В) биолога",
    ""
  ]
},
  {
  numb: 47, 
  question: "Самир - ...",  
  answer: "А) биолог ",  
  options: [
    "А) биолог ", 
    "Б) биологом",
    "В) биолога",
    ""
  ]
},
  { 
  numb: 48,
  question: "Преподаватель рассказывал о профессии ... ",  
  answer: "В) биолога",
  options: [ 
    "А) биолог ", 
    "Б) биологом",
    "В) биолога",
    ""
  ]
},
{
  numb: 49,
  question: "На экскурсии мы фотографировали ...",  
  answer: "А) нашего друга", 
  options: [
    "А) нашего друга",
    "Б) нашему другу",
    "В) у нашего друга",
    ""
  ]
},
{
  numb: 50,
  question: "Я дал ... свой фотоаппарат.",  
  answer: "Б) нашему другу",
  options: [
    "А) нашего друга",
    "Б) нашему другу",
    "В) у нашего друга",
    ""
  ]
},
{
  numb: 51,
  question: "Я знаю ...",  
  answer: "В) этого писателя", 
  options: [
    "А) этот писатель",   
    "Б) этому писателю",
    "В) этого писателя",
    ""   
  ]
}, 
{
  numb: 52,
  question: "У меня две ...",  
  answer: "Б) сестры",  
  options: [
    "А) сестёр",   
    "Б) сестры",
    "В) сёстрам",
    ""
  ]
},
{
  numb: 53,
  question: "В нашей семье семь ...",  
  answer: "Б) человек",
  options: [
    "А) человека",  
    "Б) человек",
    "В) человеком",
    ""
  ]
},
{
  numb: 54,
  question: "Они живут в этом доме одиннадцать ...", 
  answer: "А) месяцев", 
  options: [
    "А) месяцев", 
    "Б) месяц",
    "В) месяца",
    ""
  ]
},
  { 
  numb: 55,
  question: "В 2003 году Петербургу исполнилось 300 ...", 
  answer: "А) лет", 
  options: [ 
    "А) лет",  
    "Б) года",
    "В) годы",
    ""
  ]
},
  {
  numb: 56, 
  question: "В нашем городе много ...", 
  answer: "Б) театров", 
  options: [
    "А) театры", 
    "Б) театров",
    "В) театр",
    ""
  ]
},
  {
  numb: 57, 
  question: "До Москвы мы ехали восемь ...",  
  answer: "В) часов",  
  options: [
    "А) часы",
    "Б) часа ",  
    "В) часов",
    ""
  ]
},
  { 
  numb: 58,
  question: "Сегодня ... будет дискотека.",  
  answer: "Б) в общежитии",
  options: [ 
    "А) в общежитие",
    "Б) в общежитии", 
    "В) к общежитию",
    ""
  ]
},
{
  numb: 59,
  question: "Мы купили сувениры ...",  
  answer: "Б) в субботу", 
  options: [
    "А) суббота",
    "Б) в субботу",
    "В) о субботе",
    ""
  ]
},
{
  numb: 60,
  question: "Ибрагим переводит ... Достоевского.",  
  answer: "А) роман",
  options: [
    "А) роман", 
    "Б) романа",
    "В) романов",
    ""
  ]
},
{
  numb: 61,
  question: "Мы вернулись домой только ...", 
  answer: "Б) ночью", 
  options: [
    "А) ночи", 
    "Б) ночью",
    "В) ночь",
    ""
  ]
},
{
  numb: 62,
  question: "Посмотрите, какая красивая ... !",  
  answer: "В) ночь",  
  options: [
    "А) ночи", 
    "Б) ночью",
    "В) ночь",
    ""
  ]
},
{
  numb: 63,
  question: "Мы отдыхали на юге ...", 
  answer: "В) месяц", 
  options: [
    "А) месяце", 
    "Б) через месяц", 
    "В) месяц",
    ""
  ]
},
{
  numb: 64,
  question: "Я поеду домой ...",  
  answer: "Б) через месяц",
  options: [ 
    "А) месяце", 
    "Б) через месяц", 
    "В) месяц",
    ""
  ]
},
{
  numb: 65,
  question: "Экзамен по математике будет в этом ...",  
  answer: "А) месяце", 
  options: [
    "А) месяце", 
    "Б) через месяц",
    "В) месяц",
    ""
  ]
},
{
  numb: 66,
  question: "Вы очень хорошо ... стихи Лермонтова.", 
  answer: "Б) читаете", 
  options: [
    "А) читаю",
    "Б) читаете",
    "В) читают",
    ""
  ]
},
{
  numb: 67,
  question: "Студенты ... по-русски правильно.", 
  answer: "В) читают",
  options: [
    "А) читаю",
    "Б) читаете",
    "В) читают",
    ""
  ]
}, 
{
  numb: 68,
  question: "Я каждое утро ... газеты.",  
  answer: "А) читаю", 
  options: [
    "А) читаю",
    "Б) читаете",
    "В) читают",
    ""
  ]
},
{
  numb: 69,
  question: "Мы долго..., когда приедет Марина.", 
  answer: "Б) ждали", 
  options: [
    "А) ждал", 
    "Б) ждали",
    "В) ждёшь",
    ""
  ]
},
{
  numb: 70,
  question: "Завтра бабушка... внуку сказки.", 
  answer: "В) будет читать", 
  options: [
    "А) читает ",  
    "Б) читала",
    "В) будет читать",
    ""
  ]
},
{
  numb: 71,
  question: "Вчера Катя ... дома.", 
  answer: "Б) отдыхала", 
  options: [
    "А) отдыхает", 
    "Б) отдыхала",
    "В) будет отдыхать",
    ""
  ]
},
{
  numb: 72,
  question: "Раньше Пётр очень хорошо ... в футбол.",  
  answer: "Б) играл",  
  options: [
    "А) играть", 
    "Б) играл",
    "В) играет",
    ""
  ]
},
{
  numb: 73,
  question: "Скажите, пожалуйста, где можно ... конверты?", 
  answer: "Б) купить", 
  options: [
    "А) купит", 
    "Б) купить", 
    "В) купил",
    ""
  ]
},
{
  numb: 74,
  question: " - Ты уже... этот журнал?  - Нет, ещё читаю.",  
  answer: "Б) прочитал",
  options: [ 
    "А) прочитаешь",  
    "",
    "Б) прочитал",
    ""
  ]
},
{
  numb: 75,
  question: "Раньше Миша всегда ... по 2 часа.",  
  answer: "А) гулял", 
  options: [
    "А) гулял", 
    "Б) гуляет",
    "В) будет гулять",
    ""
  ]
},
{
  numb: 76,
  question: "Сейчас Маша ... картину.", 
  answer: "В) рисует", 
  options: [
    "А) рисовала",
    "Б) нарисовала",
    "В) рисует",
    ""
  ]
},
{
  numb: 77,
  question: "..., пожалуйста, что Вы сказали.", 
  answer: "Б) повторите ",
  options: [
    "А) повторяйте",  
    "Б) повторите ",
    "В) повтори",
    "" 
  ]
}, 
{
  numb: 78,
  question: "Мой дедушка каждый день ... газеты.",  
  answer: "Б) читает", 
  options: [
    "А) читать",  
    "Б) читает",
    "В) прочитать",
    ""
  ]
},
{
  numb: 79,
  question: "Ты уже... письмо?", 
  answer: "Б) написал", 
  options: [
    "А) писал ", 
    "",
    "Б) написал",
    ""
  ]
},
{
  numb: 80,
  question: "Вчера Саша долго ... рассказ. ", 
  answer: "А) писал ", 
  options: [
    "А) писал ", 
    "",
    "Б) написал",
    ""
  ]
},
{
  numb: 81,
  question: "Андрей ... контрольную работу целый час.", 
  answer: "А) писал ", 
  options: [
    "А) писал ", 
    "",
    "Б) написал",
    ""
  ]
},
{
  numb: 82,
  question: "Сейчас Юля ... в библиотеку.",  
  answer: "А) идёт",  
  options: [
    "А) идёт", 
    "",
    "Б) ходит",
    ""
  ]
},
{
  numb: 83,
  question: "Каждую неделю я ... в театр.", 
  answer: "Б) хожу", 
  options: [
    "А) иду", 
    "", 
    "Б) хожу",
    ""
  ]
},
{
  numb: 84,
  question: "Джон, ... в субботу на выставку!",  
  answer: "А) пойдём",
  options: [ 
    "А) пойдём",  
    "",
    "Б) ходим",
    ""
  ]
},
{
  numb: 85,
  question: "Летом мы часто ... на экскурсии. ",  
  answer: "Б) ходим", 
  options: [
    "А) пойдём",  
    "",
    "Б) ходим",
    ""
  ]
},
{
  numb: 86,
  question: "Я хочу есть, ... обедать!", 
  answer: "А) пойдём", 
  options: [
    "А) пойдём",  
    "",
    "Б) ходим",
    ""
  ]
},
{
  numb: 87,
  question: "Дима! ... сюда.", 
  answer: "Б) иди",
  options: [
    "А) ходи",  
    "",
    "Б) иди",
    "" 
  ]
}, 
{
  numb: 88,
  question: "Университет недалеко от общежития, мы каждый день ... туда пешком.",  
  answer: "В) ходим", 
  options: [
    "А) ездим",  
    "Б) пойдём",
    "В) ходим",
    ""
  ]
},
{
  numb: 89,
  question: "Мы каждое лето ... на море.", 
  answer: "А) ездим", 
  options: [
    "А) ездим",  
    "Б) пойдём",
    "В) ходим",
    ""
  ]
},
{
  numb: 90,
  question: "Это студенты, .... приехали из Китая", 
  answer: "Б) которые", 
  options: [
    "А) которое",  
    "Б) которые",
    "В) который",
    ""
  ]
},
{
  numb: 91,
  question: "Автобус, ... стоит на остановке, поедет в центр.", 
  answer: "В) который", 
  options: [
    "А) которое",  
    "Б) которые",
    "В) который",
    ""
  ]
},
{
  numb: 92,
  question: "Вот письмо, ... ты получил сегодня утром.",  
  answer: "А) которое",  
  options: [
    "А) которое",  
    "Б) которые",
    "В) который",
    ""
  ]
},
{
  numb: 93,
  question: "Сегодня плохая погода, ... мы пойдём гулять.", 
  answer: "В) но", 
  options: [
    "А) и", 
    "Б) а", 
    "В) но",
    ""
  ]
},
{
  numb: 94,
  question: "Мой брат - студент,  ... сестра - врач.",  
  answer: "Б) а",
  options: [ 
    "А) и", 
    "Б) а", 
    "В) но",
    ""
  ]
},
{
  numb: 95,
  question: "Джон - инженер, ... Виктор тоже инженер.",  
  answer: "А) и", 
  options: [
    "А) и", 
    "Б) а", 
    "В) но",
    ""
  ]
},
{
  numb: 96,
  question: "Наташа сказала, ... завтра будет холодно. ", 
  answer: "А) что", 
  options: [
    "А) что",
    "",
    "Б) кто",
    ""
  ]
},
{
  numb: 97,
  question: "Ребёнок любит, ... мама играет с ним.", 
  answer: "Б) когда",
  options: [
    "А) где",  
    "Б) когда",
    "В) почему",
    "" 
  ]
}, 
{
  numb: 98,
  question: "Да, я знаю, ... преподаватель.",  
  answer: "А) где", 
  options: [
    "А) где",  
    "Б) когда",
    "В) почему",
    "" 
  ]
},
{
  numb: 99,
  question: "Когда я отдыхаю, я ...", 
  answer: "Б) слушаю музыку", 
  options: [
    "А) слушал музыку", 
    "Б) слушаю музыку",
    "В) послушал музыку",
    ""
  ]
},
{
  numb: 100,
  question: "Когда мы ... упражнение, мы начали читать текст.", 
  answer: "Б) сделали", 
  options: [
    "А) делали",  
    "Б) сделали",
    "В) будем делать",
    ""
  ]
},
];